Repository: blackteahamburger/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: nl, ru_ru, sk_sk, uk_ua, zh_tw

source: Connection timed out. Is your machine slow or busy? Free up some of the machine's resources and try again.
nl: Verbinding verbroken. Is je machine traag of bezig? Maak enkele van de machinebronnen vrij en probeer opnieuw.
ru_ru: Время соединения истекло. Ваш компьютер медленный или занят? Освободите часть ресурсов компьютера и попробуйте еще раз.
sk_sk: Časový limit pre spojenie vypršal. Nie je váš počítač pomalý alebo zaneprázdnený? Pokúste sa uvoľniť niektoré zdroje na vašom počítači a skúste to znova.
uk_ua: Час очікування з 'єднання закінчився. Ваш комп' ютер повільний або зайнятий? Звільніть деякі ресурси машини та спробуйте ще раз.
zh_tw: 連線逾時。是你的電腦執行太慢還是執行太多東西？嘗試釋放記憶體或 CPU 資源後再試一次吧。

source: Could not find localhost. Ensure you have '127.0.0.1 localhost' in your /etc/hosts file.
nl: Kan localhost niet vinden. Controleer of je '127.0.0.1 localhost' in je /etc/hosts bestand hebt.
sk_sk: Nepodarilo sa nájsť localhost. Uistite sa, že máte záznam '127.0.0.1 localhost' v súbore /etc/hosts.
zh_tw: 找不到 localhost。 請確認你的 /etc/hosts 檔案裡有這一段：「127.0.0.1 localhost」。

source: Select Mode
nl: Selecteer Modus
ru_ru: Выберите режим
sk_sk: Zvoľte režim
uk_ua: Виберіть режим
zh_tw: 選擇模式

source: Please select the desired mode then click "OK". Otherwise, click "Cancel".
nl: Selecteer de gewenste modus en klik dan op "OK". Anders, kies "Annuleren".
ru_ru: Пожалуйста, выберите желаемый режим и нажмите «ОК». В противном случае нажмите «Отмена».
sk_sk: Zvoľte si prosím požadovaný režim a potom kliknite na tlačidlo "OK". V opačnom prípade kliknite na tlačidlo "Zrušiť".
uk_ua: Виберіть потрібний режим, а потім натисніть "OK". В іншому випадку натисніть "Скасувати".
zh_tw: 請選擇所需模式，然後點選「確定」。否則，請點選「取消」。

source: Change mode at any time by clicking the "Mode" button containing Mu's logo.
nl: Verander de modus op ieder moment door op de "Modus" knop met het Mu logo te klikken.
ru_ru: Вы можете изменить режим работы редактора в любое время, нажав кнопку "Режим" с логотипом Mu.
sk_sk: Režim môžete zmeniť kedykoľvek kliknutím na tlačidlo "Režim" s logom editora Mu.
uk_ua: Ви можете змінити режим у будь-який час, натискнучи кнопку "Режим", що містить логотип М'ю.
zh_tw: 透過點選有 Mu 圖示的「模式」按鈕來隨時變更模式。

source: When reporting a bug, copy and paste the content of the following log file.
nl: Wanneer je een bug wil rapporteren, kopieer en plak de inhoud van het volgende log bestand.
ru_ru: Сообщая об ошибке, пожалуйста, приложите к сообщению предоставленный ниже лог.
sk_sk: Pri nahlasovaní chyby skopírujte a vložte obsah tohto záznamníka.
uk_ua: Повідомляючи про помилку, скопіюйте та вставте вміст наступного файла журналу.
zh_tw: 回報 bug 時，複製並貼上以下記錄檔的內容。

source: The environment variables shown below will be set each time you run a Python 3 script. Each separate environment variable should be on a new line and of the form: NAME=VALUE
zh_tw: 每次執行 Python 3 腳本時都會設定下面的環境變數。 每行一個獨立的環境變數，形式如下： 名稱=值

source: Override the built-in MicroPython runtime with the following hex file (empty means use the default):
nl: Overschrijf de ingebouwde MicroPython-runtime met het volgende hex-bestand (leeg betekent gebruik de standaard):
ru_ru: Замените встроенную среду выполнения MicroPython следующим шестнадцатеричным файлом (пустой означает использование значения по умолчанию):
sk_sk: Prepísať vstavaný MicroPython s nasledujúcim hex súborom (ak nič neuvediete, použije sa predvolené nastavenie):
uk_ua: Перевизначення вбудованого середовища виконання MicroPython за допомогою наступного шістнадцяткового файла (порожній означає використання типового):
zh_tw: 使用下面的 hex 檔案覆寫內建的 MicroPython 執行環境（留空使用預設檔案）：

source: The folks at <a href='https://www.pythonanywhere.com/'>PythonAnywhere</a> make it easy for learners and educators to host simple web projects for free. You'll need to sign up for an account and provide the following details for Mu to deploy your web project.
zh_tw: <a href='https://www.pythonanywhere.com/'>PythonAnywhere</a> 團隊讓學習者和教育者可以免費託管簡單的網頁專案。你需要註冊一個帳號，並填寫以下資訊，Mu 才能部署你的網頁專案。

source: Copy your username on PythonAnywhere into here:
zh_tw: 請將你在 PythonAnywhere 上的使用者名稱複製到這裡：

source: username
zh_tw: 使用者名稱

source: Copy your <a href='https://www.pythonanywhere.com/account/#api_token'>secret API token from PythonAnywhere</a> into here:
zh_tw: 請將你在 <a href='https://www.pythonanywhere.com/account/#api_token'>PythonAnywhere 上的 API 金鑰</a> 複製到這裡：

source: secret api token
zh_tw: API 金鑰

source: Server location ('www' is a safe default):
zh_tw: 伺服器位置（「www」是安全的預設值）：

source: Automatically detect
nl: Automatisch detecteren
ru_ru: Определить автоматически
sk_sk: Rozpoznať automaticky
uk_ua: Автоматично визначати
zh_tw: 自動偵測

source: Please select the language for Mu's user interface from the choices listed below. <strong>Restart Mu for these changes to take effect.</strong>
nl: Selecteer de taal voor de gebruikersinterface van Mu uit de onderstaande keuzes. <strong>Start Mu opnieuw om deze wijzigingen door te voeren.</strong>
ru_ru: Пожалуйста, выберите язык для пользовательского интерфейса Mu из вариантов, перечисленных ниже. <strong> Перезапустите Mu, чтобы изменения вступили в силу. </strong>
sk_sk: Vyberte si prosím jazyk používateľského rozhrania Mu z možností uvedených nižšie. <strong>Aby sa tieto zmeny prejavili, reštartujte Mu.</strong>
uk_ua: Будь ласка, виберіть мову для інтерфейсу користувача М'ю з перелічених нижче варіантів. <strong>Перезапустіть М'ю, щоб ці зміни набули чинності.</strong>
zh_tw: 請從下面列出的選項中選擇 Mu 的使用者介面語言。<strong>重新啟動 Mu 以使這些變更生效。</strong>

source: How to flash MicroPython to your device
nl: Hoe kunt u MicroPython flashen naar uw apparaat
ru_ru: Как записать файл прошивки MicroPython на ваше устройство
sk_sk: Ako zapísať MicroPython do vášho zariadenia
uk_ua: Як записати файл прошивки MicroPython на ваш пристрій
zh_tw: 如何將 MicroPython 刷入到你的裝置

source: &nbsp;1. Determine the type of device (ESP8266 or ESP32)<br />&nbsp;2. Download firmware from the <a href="https://micropython.org/download" style="color:#039be5;">https://micropython.org/download</a><br/>&nbsp;3. Connect your device<br/>&nbsp;4. Load the .bin file below using the 'Browse' button<br/>&nbsp;5. Press 'Erase & write firmware'
nl: &nbsp;1. Bepaal het type apparaat (ESP8266 of ESP32)<br />&nbsp;2. Download firmware van de <a href="https://micropython.org/download" style="color:#039be5;">https://micropython.org/download</a><br/>&nbsp;3. Sluit uw apparaat aan<br/>&nbsp;4. Laad het .bin-bestand hieronder met de knop 'Bladeren'<br/>&nbsp;5. Druk op 'Wis & schrijf firmware'
ru_ru: &nbsp; 1. Определите тип устройства (ESP8266 или ESP32) <br /> 2. Загрузите прошивку со страницы <a href="https://micropython.org/download" style="color:#039be5;"> https://micropython.org/download </a> <br/> &nbsp; 3. Подключите устройство <br/> &nbsp; 4. Используя кнопку "Обзор", выберите файл прошивки (.bin) <br/> &nbsp; 5. Нажмите "Стереть и записать прошивку".
sk_sk: &nbsp;1. Zistite typ zariadenia (ESP8266 alebo ESP32)<br />&nbsp;2. Stiahnite si firmvér zo stránky <a href="https://micropython.org/download" style="color:#039be5;">https://micropython.org/download</a><br/>&nbsp;3. Pripojte svoje zariadenie<br/>&nbsp;4. Pomocou tlačidla 'Prehliadať' načítajte .bin súbor<br/>&nbsp;5. Stlačte 'Vymazať a zapísať firmvér'
uk_ua: 1. Визначте тип пристрою (ESP8266 або ESP32) 2<br />. Завантажте прошивку з https://micropython.org/download <a href="https://micropython.org/download" style="color:#039be5;">3</a><br/>. Підключіть пристрій 4.<br/>Завантажте файл .bin нижче за допомогою кнопки "Перегляд" 5.<br/>Натисніть "Видалити та записати мікропрограмне забезпечення"
zh_tw: &nbsp;1. 確定裝置類型（ ESP8266 或 ESP32 ）<br />&nbsp;2. 從 <a href="https://micropython.org/download" style="color:#039be5;">https://micropython.org/download</a> 下載韌體<br/>&nbsp;3. 連接裝置<br/>&nbsp;4. 用「瀏覽」按鈕載入 .bin 檔案<br/>&nbsp;5. 點選「清除 & 寫入韌體」

source: Device:
nl: Apparaat:
sk_sk: Zariadenie:
zh_tw: 裝置：

source: Choose device type:
nl: Kies apparaattype:
sk_sk: Vyberte typ zariadenia:
zh_tw: 選擇裝置類型：

source: Firmware (.bin):
sk_sk: Firmvér (.bin):
zh_tw: 韌體（.bin）：

source: Browse
ru_ru: Обзор
sk_sk: Prehliadať
uk_ua: Огляд
zh_tw: 瀏覽

source: Erase && write firmware
nl: Wis && schrijf firmware
ru_ru: Очистить устройство и записать прошивку
sk_sk: Vymazať a zapísať firmvér
uk_ua: Стирання і запис мікропрограмного забезпечення
zh_tw: 清除 && 寫入韌體

source: Select MicroPython firmware (.bin)
nl: Selecteer MicroPython-firmware (.bin)
sk_sk: Vyberte MicroPython firmvér (.bin)
zh_tw: 選擇 MicroPython 韌體（.bin）

source: Firmware (*.bin)
sk_sk: Firmvér (.bin)
zh_tw: 韌體（*.bin）

source: Mu Administration
nl: Mu Administratie
ru_ru: Администрирование Mu
sk_sk: Správa Mu
uk_ua: Адміністрування М'ю
zh_tw: Mu 管理

source: Current Log
nl: Huidig logboek
ru_ru: Текущий лог
sk_sk: Aktuálny záznamník
uk_ua: Поточний журнал
zh_tw: 目前記錄

source: Python3 Environment
nl: Python3-omgeving
ru_ru: Переменные окружения скриптов Python3
sk_sk: Prostredie Python 3
uk_ua: Середовище Python3
zh_tw: Python3 環境

source: BBC micro:bit Settings
nl: BBC micro:bit-instellingen
ru_ru: BBC micro:bit Настройки
sk_sk: Nastavenie BBC micro:bit
uk_ua: Налаштування BBC micro:bit
zh_tw: BBC micro:bit 設定

source: ESP Firmware flasher
ru_ru: Загрузчик прошивки ESP
sk_sk: Zapisovač firmvéru do ESP
uk_ua: Завантажувач прошивки ESP
zh_tw: ESP 韌體刷入器

source: Select Language
nl: Selecteer taal
ru_ru: Выберите язык
sk_sk: Vybrať jazyk
uk_ua: Оберіть мову
zh_tw: 選擇語言

source: Find / Replace
nl: Zoeken / Vervangen
ru_ru: Найти / Заменить
sk_sk: Nájsť / Nahradiť
uk_ua: Пошук і заміна ...
zh_tw: 尋找 / 取代

source: Find:
nl: Zoek:
ru_ru: Найти:
sk_sk: Nájsť:
uk_ua: Знайти:
zh_tw: 尋找：

source: Replace (optional):
nl: Vervangen (optioneel):
ru_ru: Заменить (необязательно):
sk_sk: Nahradiť (voliteľné):
uk_ua: Замінити (необов’язково):
zh_tw: 取代（選用）：

source: Replace all?
nl: Vervang alles?
ru_ru: Заменить всё?
sk_sk: Nahradiť všetky?
uk_ua: Замінити всі?
zh_tw: 全部取代？

source: untitled
nl: ongetiteld
ru_ru: без названия
sk_sk: bez názvu
uk_ua: Без назви
zh_tw: 未命名

source: Mode
nl: Modus
ru_ru: Режим
sk_sk: Režim
uk_ua: Режим
zh_tw: 模式

source: Change Mu's mode of behaviour.
nl: Verander de manier van gedrag van Mu.
ru_ru: Выбор режима работы редактора Mu.
sk_sk: Zmení režim správania Mu.
uk_ua: Змінити режим поведінки М'ю.
zh_tw: 改變 Mu 的執行模式。

source: New
nl: Nieuw
ru_ru: Новый скрипт
sk_sk: Nový
uk_ua: Новий
zh_tw: 新增

source: Create a new Python script.
nl: Maak een nieuw Python-script.
ru_ru: Создать новый Python скрипт.
sk_sk: Vytvorí nový skript v jazyku Python.
uk_ua: Створити новий скрипт Python.
zh_tw: 建立一個新的 Python 腳本。

source: Load
nl: Laden
ru_ru: Открыть файл
sk_sk: Nahrať
uk_ua: Завантажити
zh_tw: 載入

source: Load a Python script.
nl: Laad een Python-script.
ru_ru: Загрузить скрипт Python.
sk_sk: Nahrá skript v jazyku Python.
uk_ua: Завантажити скрипт Python.
zh_tw: 載入一個 Python 腳本。

source: Save
nl: Opslaan
ru_ru: Сохранить файл
sk_sk: Uložiť
uk_ua: Зберегти
zh_tw: 儲存

source: Save the current Python script.
nl: Sla het huidige Python-script op.
ru_ru: Сохранить текущий скрипт Python.
sk_sk: Uloží aktuálny skript v jazyku Python.
uk_ua: Зберегти поточний скрипт Python.
zh_tw: 儲存目前 Python 腳本。

source: Zoom-in
ru_ru: Увеличить текст
sk_sk: Priblížiť
uk_ua: Збільшити
zh_tw: 放大

source: Zoom in (to make the text bigger).
nl: Zoom in (om de tekst groter te maken).
ru_ru: Сделать текст больше.
sk_sk: Priblíženie (aby bol text väčší).
uk_ua: Збільшити (щоб текст був більшим).
zh_tw: 放大文字。

source: Zoom-out
nl: Zoom-uit
ru_ru: Уменьшить текст
sk_sk: Oddialiť
uk_ua: Зменшити
zh_tw: 縮小

source: Zoom out (to make the text smaller).
nl: Zoom uit (om de tekst kleiner te maken).
ru_ru: Сделать текст меньше
sk_sk: Oddialenie (aby bol text menší).
uk_ua: Зменшити масштаб (щоб зменшити текст).
zh_tw: 縮小文字。

source: Theme
nl: Thema
ru_ru: Тема
sk_sk: Téma
uk_ua: Тема
zh_tw: 主題

source: Toggle theme between day, night or high contrast.
nl: Wissel thema tussen dag, nacht of hoog contrast.
ru_ru: Переключайте тему между дневной, ночной или высоко-контрастной.
sk_sk: Prepne tému medzi dennou, nočnou alebo vysokým kontrastom.
uk_ua: Перемикач теми між днем, ніччю або високою контрастністю.
zh_tw: 切換日間、夜間或高對比的主題。

source: Check
nl: Controleren
ru_ru: Проверить код
sk_sk: Skontrolovať
uk_ua: Перевірити
zh_tw: 檢查

source: Check your code for mistakes.
nl: Controleer je code op fouten.
ru_ru: Проверка вашего кода на ошибки.
sk_sk: Skontroluje, či sa vo vašom kóde nenachádzajú chyby.
uk_ua: Перевірити свій код на помилки.
zh_tw: 檢查程式碼中的錯誤。

source: Tidy
nl: Maak netjes
ru_ru: Отформатировать код
sk_sk: Upratať
uk_ua: Форматувати код
zh_tw: 格式化

source: Tidy up the layout of your code.
nl: Maak de lay-out van uw code netjes.
ru_ru: Отформатировать код скрипта утилитой "Black".
sk_sk: Naformátuje kód.
uk_ua: Форматувати код скрипта.
zh_tw: 整理程式碼格式。

source: Help
ru_ru: Помощь
sk_sk: Pomocník
uk_ua: Допомога
zh_tw: 說明

source: Show help about Mu in a browser.
nl: Help over Mu weergeven in een browser.
ru_ru: Открыть страницу помощи Mu в браузере.
sk_sk: Zobrazí pomocníka o Mu v prehliadači.
uk_ua: Показати довідку про М'ю в браузері.
zh_tw: 在瀏覽器中顯示關於 Mu 的說明內容。

source: Quit
nl: Afsluiten
ru_ru: Выход
sk_sk: Ukončiť
uk_ua: Вихід
zh_tw: 結束

source: Quit Mu.
nl: Mu Afsluiten.
ru_ru: Закрыть редактор Mu.
sk_sk: Ukončí Mu.
uk_ua: Вийти з М'ю.
zh_tw: 結束 Mu。

source: Close file
nl: Sluit bestand
ru_ru: Закрыть файл
sk_sk: Zatvoriť súbor
uk_ua: Закрити файл
zh_tw: 關閉檔案

source: Copy selected text to REPL
nl: Kopieer geselecteerde tekst naar REPL
ru_ru: Вставить выделенный текст в REPL
sk_sk: Skopírovať vybratý text do REPL
uk_ua: Скопіювати вибраний текст до REPL
zh_tw: 複製選取的文字到 REPL

source: Filesystem on
nl: Bestandssysteem op
ru_ru: Файловая система на
sk_sk: Súborový systém na
uk_ua: Файлова система на
zh_tw: 檔案系統：

source: Python3 data tuple
nl: Python3-gegevenstupel
ru_ru: Кортеж данных Python3
uk_ua: Кортеж даних Python3
zh_tw: Python3 資料元組

source: {} Plotter
sk_sk: {} Ploter
zh_tw: {} 繪圖器

source: Running: {}
nl: Draaiend: {}
sk_sk: Spustený: {}
uk_ua: Виконання: {}
zh_tw: 執行：{}

source: Debug Inspector
nl: Debug Inspecteur
ru_ru: Инспектор отладки
sk_sk: Inšpektor ladenia
uk_ua: Інспектор налагодження
zh_tw: 偵錯檢查器

source: Name
nl: Naam
ru_ru: Имя
sk_sk: Názov
uk_ua: Назва
zh_tw: 名稱

source: Value
nl: Waarde
ru_ru: Значение
sk_sk: Hodnota
uk_ua: Значення
zh_tw: 值

source: (A list of {} items.)
nl: (Een lijst met {} items.)
ru_ru: (Список из {} элементов.)
sk_sk: (Zoznam s počtom položiek {}.)
uk_ua: (Список {} елементів.)
zh_tw: （含有 {} 項的清單 (list)。）

source: (A dict of {} items.)
nl: (Een woordenboek van {} items.)
ru_ru: (Словарь, содержащий {} ключей.)
sk_sk: (Slovník s počtom položiek {}.)
uk_ua: (Словник {} елементів.)
zh_tw: （含有 {} 項的字典 (dict)。）

source: Uploading to PythonAnywhere. This may take some time and pause at the end (as the website is started).
zh_tw: 正在上傳到 PythonAnywhere。 這可能需要一些時間，並在最後暫停（因為網站正在啟動）。

source: <p>Your website was successfully deployed.</p><p>You can see it here:</p><a href='https://{domain}'>https://{domain}</a>
zh_tw: <p>你的網站已成功部署。</p><p>你可以在這裡存取：</p><a href='https://{domain}'>https://{domain}</a>

source: There was a problem deploying to PythonAnywhere:<br/><br/>
zh_tw: 部署到 PythonAnywhere 時出現了一個問題：<br/><br/>

source: Please check your PythonAnywhere settings or connection and ensure you're using a recent version of Mu.<br/><br/>Alternatively, <a href='https://github.com/blackteahamburger/mu/issues/new/choose'>submit a bug report</a>.
zh_tw: 請檢查你的 PythonAnywhere 設定或網路連線，並確保你正在使用最新版的 Mu。<br/><br/>或者，<a href='https://github.com/blackteahamburger/mu/issues/new/choose'>提交一個 bug 報告</a>。

source: Mu's current mode of behaviour.
nl: Mu's huidige gedrag.
ru_ru: Текущий режим работы редактора Mu.
sk_sk: Aktuálny režim správania sa editora Mu.
uk_ua: Поточний спосіб поведінки М'ю.
zh_tw: Mu 目前的執行模式。

source: Detected new {} device: {}.
nl: Nieuw {} apparaat gedetecteerd: {}.
ru_ru: Обнаружено новое {} устройство: {}.
sk_sk: Bolo rozpoznané nové zariadenie {}: {}.
uk_ua: Виявлено новий {} пристрій {}.
zh_tw: 偵測到新的 {} 裝置：{}。

source: Detected new {} device.
nl: Nieuw {} apparaat gedetecteerd.
ru_ru: Обнаружено новое {} устройство.
sk_sk: Bolo rozpoznané nové zariadenie {}.
uk_ua: Виявлено новий {} пристрій.
zh_tw: 偵測到新的 {} 裝置。

source: File already exists; overwrite it?
nl: Bestand bestaat al; bestand overschrijven?
ru_ru: Файл уже существует; перезаписать?
sk_sk: Súbor už existuje; chcete ho prepísať?
uk_ua: Файл вже існує. Перезаписати його?
zh_tw: 檔案已存在，是否覆寫？

source: File already exists
nl: Bestand bestaat al
ru_ru: Файл уже существует
sk_sk: Súbor už existuje
uk_ua: Файл вже існує
zh_tw: 檔案已存在

source: Copying '{}' to device.
nl: '{}' kopi�ren naar apparaat.
ru_ru: Копирование '{}' на устройство.
sk_sk: Na zariadenie sa kopíruje súbor '{}'.
uk_ua: Копіювання '{}' на пристрій.
zh_tw: 正在將「{}」複製到裝置。

source: '{}' successfully copied to device.
nl: '{}' succesvol gekopieerd naar apparaat.
ru_ru: '{}' успешно скопировано на устройство.
sk_sk: Na zariadenie bol úspešne prekopírovaný súbor '{}'.
uk_ua: '{}' успішно скопійовано на пристрій.
zh_tw: 已成功將「{}」複製到裝置。

source: Delete (cannot be undone)
nl: Verwijderen (kan niet ongedaan worden gemaakt)
ru_ru: Удалить (это действие невозможно отменить)
sk_sk: Odstrániť (nedá sa vrátiť)
uk_ua: Видалити (неможливо скасувати)
zh_tw: 刪除（無法復原）

source: Deleting '{}' from device.
nl: '{}' van apparaat verwijderen.
ru_ru: Удаление '{}' с устройства.
sk_sk: Zo zariadenia sa odstraňuje súbor '{}'.
uk_ua: Видалення '{}' з пристрою.
zh_tw: 正在從裝置中刪除「{}」。

source: '{}' successfully deleted from device.
nl: '{}' succesvol verwijderd van apparaat.
ru_ru: '{}' успешно удалено с устройства.
sk_sk: Zo zariadenia bol úspešne odstránený súbor '{}'.
uk_ua: '{}' успішно видалено з пристрою.
zh_tw: 已成功從裝置中刪除「{}」。

source: Getting '{}' from device. Copying to '{}'.
nl: '{}' ophalen van het apparaat. kopi�ren naar '{}'.
ru_ru: Получение '{}' с устройства. Копирование в '{}'.
sk_sk: Zo zariadenia sa získava '{}'. Kopíruje sa do '{}'.
uk_ua: Отримання '{}' з пристрою. Копіювання до '{}'.
zh_tw: 正從裝置中取得「{}」並複製到「{}」。

source: Successfully copied '{}' from the device to your computer.
nl: '{}' is met succes van het apparaat naar uw computer gekopieerd.
ru_ru: '{}' Успешно скопирован с устройства на ваш компьютер.
sk_sk: Zo zariadenia bol úspešne prekopírovaný súbor '{}' na váš počítač.
uk_ua: Успішно скопійовано '{}' з пристрою на комп 'ютер.
zh_tw: 已成功將「{}」從裝置複製到你的電腦上。

source: Open in Mu
ru_ru: Открыть в Mu
sk_sk: Otvoriť v Mu
uk_ua: Відкрити в М'ю
zh_tw: 在 Mu 中開啟

source: Write to main.py on device
nl: Schrijf naar main.py op apparaat
ru_ru: Запись в main.py на устройстве
sk_sk: Zapísať do súboru main.py na zariadení
uk_ua: Запис до main.py на пристрої
zh_tw: 寫入到裝置上的 main.py

source: Open
ru_ru: Открыть
sk_sk: Otvoriť
uk_ua: Відкрийти
zh_tw: 開啟

source: Opening '{}'
nl: '{}' openen
ru_ru: Открытие '{}'
sk_sk: Otvára sa '{}'
uk_ua: Відкривання '{}'
zh_tw: 正在開啟「{}」

source: Files on your device:
nl: Bestanden op uw apparaat:
ru_ru: Файлы на вашем устройстве:
sk_sk: Súbory na vašom zariadení:
uk_ua: Файли на вашому пристрої:
zh_tw: 裝置上的檔案：

source: Files on your computer:
nl: Bestanden op uw computer:
ru_ru: Файлы на вашем компьютере:
sk_sk: Súbory na vašom počítači:
uk_ua: Файли на вашому комп’ютері:
zh_tw: 電腦上的檔案：

source: There was a problem getting the list of files on the device. Please check Mu's logs for technical information. Alternatively, try unplugging/plugging-in your device and/or restarting Mu.
nl: Er is een probleem opgetreden bij het ophalen van de lijst met bestanden op het apparaat. Raadpleeg de logboeken van Mu voor technische informatie. U kunt ook proberen uw apparaat los te koppelen/aan te sluiten en/of Mu opnieuw op te starten.
ru_ru: Не удалось получить список файлов на устройстве. Пожалуйста, проверьте логи Mu для получения детальной информации. Или попробуйте отключить / подключить ваше устройство и / или перезапустить Mu.
sk_sk: Pri získavaní zoznamu súborov z vášho zariadenia sa vyskytol problém. Pre ďalšie technické informácie o tomto probléme prosím skontrolujte záznamník editora Mu . Prípadne môžete vyskúšať odpojiť/pripojiť vaše zariadenie a/alebo reštartovať Mu.
uk_ua: Виникла проблема з отриманням списку файлів на пристрої. Будь ласка, перевірте журнали М'ю для отримання технічної інформації. Крім того, спробуйте вимкнути/підключити пристрій та/або перезапустити М'ю.
zh_tw: 取得裝置上的檔案清單時出現問題。請檢視Mu的記錄以取得技術資訊。或者嘗試重新插拔裝置和/或重新啟動 Mu。

source: There was a problem copying the file '{}' onto the device. Please check Mu's logs for more information.
nl: Er is een probleem opgetreden bij het kopi�ren van het bestand '{}' naar het apparaat. Raadpleeg de logboeken van Mu voor meer informatie.
ru_ru: При копировании файла '{}' на устройство возникла проблема. Пожалуйста, проверьте логи Mu для получения дополнительной информации.
sk_sk: Pri kopírovaní súboru '{}' na zariadenie nastala chyba. Pre viac informácií prosím skontrolujte záznamník editora Mu.
uk_ua: Виникла проблема з копіюванням файлу '{}' на пристрій. Будь ласка, перевірте журнали М'ю для отримання додаткової інформації.
zh_tw: 將檔案「{}」複製到裝置上時出現問題。請檢視 Mu 的記錄以取得更多資訊。

source: There was a problem deleting '{}' from the device. Please check Mu's logs for more information.
nl: Er is een probleem opgetreden bij het verwijderen van '{}' van het apparaat. Raadpleeg de logboeken van Mu voor meer informatie.
ru_ru: При удалении "{}" с устройства возникла проблема. Пожалуйста, проверьте логи Mu для получения дополнительной информации.
sk_sk: Pri mazaní súboru '{}' z vášho zariadenia nastala chyba. Pre viac informácií prosím skontrolujte záznamník editora Mu.
uk_ua: Під час видалення " '{}' з пристрою сталася помилка. Будь ласка, перевірте журнали М'ю для отримання додаткової інформації.
zh_tw: 從裝置刪除「{}」時出現問題。請檢視 Mu 的記錄以取得更多資訊。

source: There was a problem getting '{}' from the device. Please check Mu's logs for more information.
nl: Er is een probleem opgetreden bij het ophalen van '{}' van het apparaat. Raadpleeg de logboeken van Mu voor meer informatie.
ru_ru: Не удалось получить "{}" с устройства. Пожалуйста, проверьте логи Mu для получения дополнительной информации.
sk_sk: Pri získavaní súboru '{}' zo zariadenia nastala chyba. Pre viac informácií prosím skontrolujte záznamník editora Mu.
uk_ua: Виникла проблема з отриманням '{}' з пристрою. Будь ласка, перевірте журнали М'ю для отримання додаткової інформації.
zh_tw: 從裝置取得「{}」時出現問題。請檢視 Mu 的記錄以取得更多資訊。

source: No device connected.
ru_ru: Устройство не подключено.
sk_sk: Nie je pripojené žiadne zariadenie.
uk_ua: Немає підключених пристроїв
zh_tw: 無裝置已連線。

source: Hello, World!
nl: Hallo, Wereld!
ru_ru: Привет, Мир!
sk_sk: Ahoj, svet!
uk_ua: Вітаю, світе!
zh_tw: 你好，世界！

source: This editor is free software written in Python. You can modify it, add features or fix bugs if you like.
nl: Deze editor is gratis software geschreven in Python. Je kunt het aanpassen, functies toevoegen of bugs repareren als je wilt.
ru_ru: Этот редактор представляет собой бесплатное программное обеспечение, написанное на Python. Вы можете изменить его, добавить функции или исправить ошибки, если хотите.
sk_sk: Tento editor je otvorený softvér napísaný v jazyku Python. Ak chcete, môžete ho upravovať, pridávať nové funkcie alebo opravovať chyby.
uk_ua: Цей редактор є вільним програмним забезпеченням, написаним на мові Python. Ви можете змінити його, додати функції або виправити помилки, якщо хочете.
zh_tw: 這個編輯器是用 Python 編寫的自由軟體。你可以根據需要修改，新增功能或修復錯誤。
