Repository: blackteahamburger/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: nl, ru_ru, sk_sk, uk_ua, zh_tw

source: Run
nl: Uitvoeren
ru_ru: Запустить
sk_sk: Spustiť
uk_ua: Запуск
zh_tw: 執行

source: Run your code directly on the {board_name} via the REPL.
nl: Voer je code rechtstreeks uit op de {board_name} via de REPL.
ru_ru: Запустите свой код прямо на {board_name} через REPL.
sk_sk: Spustí váš kód priamo na doske {board_name} cez REPL.
uk_ua: Запустіть свій код безпосередньо на {board_name} через REPL.
zh_tw: 透過 REPL 直接在 {board_name} 上執行你的程式碼。

source: Files
nl: Bestanden
ru_ru: Файлы
sk_sk: Súbory
uk_ua: Файли
zh_tw: 檔案

source: Access the file system on {board_name}.
nl: Open het bestandssysteem op {board_name}.
ru_ru: Доступ к файловой системе на {board_name}.
sk_sk: Pristúpi k súborovému systému na zariadení {board_name}.
uk_ua: Доступ до файлової системи на {board_name}.
zh_tw: 存取 {board_name} 上的檔案系統。

source: Use the REPL to live-code on the {board_name}.
nl: Gebruik de REPL om live te coderen op de {board_name}.
ru_ru: Используйте REPL для немедленного исполнения кода на {board_name}.
sk_sk: Použite REPL na živé programovanie na doske {board_name}.
uk_ua: Використовуйте REPL для 'живого' коду на {board_name}.
zh_tw: 使用 REPL 在 {board_name} 上即時編寫程式碼。

source: REPL and file system cannot work at the same time.
nl: REPL en bestandssysteem kunnen niet tegelijkertijd werken.
ru_ru: REPL и файловая система не могут работать одновременно.
sk_sk: REPL a súborový systém nemôžu pracovať súčasne.
uk_ua: REPL та файлова система не можуть працювати одночасно.
zh_tw: REPL 和檔案系統不能同時工作。

source: The REPL and file system both use the same USB serial connection. Only one can be active at any time. Toggle the file system off and try again.
nl: De REPL en het bestandssysteem gebruiken beide dezelfde seri�le USB-verbinding. Er kan er maar �en actief zijn. Schakel het bestandssysteem uit en probeer het opnieuw.
ru_ru: REPL и файловая система используют одно и то же последовательное соединение USB. Только одно из них может быть активно в одно и то же время. Отключитесь от файловой системы и попробуйте еще раз.
sk_sk: REPL spolu so súborovým systémom používajú rovnaké sériové spojenie cez USB. Naraz môže byť aktívne len jedno. Vypnite súborový systém a skúste to znova.
uk_ua: REPL і файлова система використовують однакове послідовне з'єднання USB. Тільки один може бути активним у будь-який час. Вимкніть файлову систему та повторіть спробу.
zh_tw: REPL 和檔案系統都使用相同的 USB 序列埠通訊。任何時候只能使用其中一個功能。請關閉檔案系統，然後重試。

source: The plotter and file system cannot work at the same time.
nl: De plotter en het bestandssysteem kunnen niet tegelijkertijd werken.
ru_ru: Плоттер и файловая система не могут работать одновременно.
sk_sk: Ploter a súborový systém nemôžu pracovať súčasne.
uk_ua: Плотер і файлова система не можуть працювати одночасно.
zh_tw: 繪圖器和檔案系統無法同時工作。

source: The plotter and file system both use the same USB serial connection. Only one can be active at any time. Toggle the file system off and try again.
nl: De plotter en het bestandssysteem gebruiken beide dezelfde seri�le USB-aansluiting. Er kan er maar ��n actief zijn. Schakel het bestandssysteem uit en probeer het opnieuw.
ru_ru: Плоттер и файловая система используют одно и то же последовательное соединение USB. Только одно из них может быть активно в одно и то же время. Отключитесь от файловой системы и попробуйте еще раз.
sk_sk: Ploter spolu so súborovým systémom používajú rovnaké sériové spojenie cez USB. Naraz môže byť aktívne len jedno. Vypnite súborový systém a skúste to znova.
uk_ua: Плотер і файлова система використовують однакове послідовне з'єднання USB. Тільки один може бути активним у будь-який час. Вимкніть файлову систему та повторіть спробу.
zh_tw: 繪圖器和檔案系統都使用相同的 USB 序列埠通訊。任何時候只能使用其中一個功能。請關閉檔案系統，然後重試。

source: Cannot run anything without any active editor tabs.
nl: Kan niets uitvoeren zonder actieve editortabbladen.
ru_ru: Невозможно запустить что-либо без активных вкладок редактора.
sk_sk: Nič sa nedá spustiť bez aktívnych kariet editora.
uk_ua: Нічого не можна запустити без активних вкладок редактора.
zh_tw: 不能沒有作用中的編輯器分頁時執行程式。

source: Running transfers the content of the current tab onto the device. It seems like you don't have any tabs open.
nl: Met Running wordt de inhoud van het huidige tabblad naar het apparaat overgebracht. Het lijkt alsof je geen tabbladen open hebt staan.
ru_ru: Запуск передает содержимое текущей вкладки (код) на устройство. Похоже, у вас нет открытых вкладок.
sk_sk: Spúšťa sa prenos obsahu aktuálnej karty do zariadenia. Zdá sa, že nemáte otvorené žiadne karty.
uk_ua: Виконання передає вміст поточної вкладки на пристрій. Схоже, у вас немає відкритих вкладок.
zh_tw: 「執行」將把目前編輯器分頁的內容傳輸至裝置。未能找到任何開啟的分頁。

source: File system cannot work at the same time as the REPL or plotter.
nl: Het bestandssysteem kan niet tegelijkertijd met de REPL of plotter werken.
ru_ru: Файловая система не может работать одновременно с REPL или плоттером.
sk_sk: Súborový systém nemôže pracovať súčasne s REPL alebo plottrom.
uk_ua: Файлова система не може працювати одночасно з REPL або плотером.
zh_tw: 檔案系統無法與 REPL 或繪圖器同時工作。

source: The file system and the REPL and plotter use the same USB serial connection. Toggle the REPL and plotter off and try again.
nl: Het bestandssysteem en de REPL en plotter gebruiken dezelfde seri�le USB-verbinding. Schakel de REPL en plotter uit en probeer het opnieuw.
ru_ru: Файловая система, REPL и плоттер используют одно и то же последовательное соединение USB. Выключите REPL и плоттер и попробуйте снова.
sk_sk: Súborový systém, REPL a ploter používajú rovnaké sériové pripojenie cez USB. Vypnite REPL a zapisovač a skúste to znova.
uk_ua: Файлова система та REPL та плотер використовують одне і те ж послідовне з'єднання USB. Вимкніть REPL та плотер та спробуйте ще раз.
zh_tw: 檔案系統、REPL、繪圖器使用相同的 USB 序列埠通訊。請關閉 REPL 和繪圖器，然後重試。

source: Could not find an attached {board_name}
nl: Kan een aangesloten {board_name} niet vinden
ru_ru: Не удалось найти подключенную {board_name}
sk_sk: Nepodarilo sa nájsť pripojenú dosku {board_name}
uk_ua: Не вдалося знайти приєднаний пристрій {board_name}.
zh_tw: 找不到已連線的 {board_name}

source: Please make sure the device is plugged into this computer. The device must have MicroPython flashed onto it before the file system will work. Finally, press the device's reset button and wait a few seconds before trying again.
nl: Zorg ervoor dat het apparaat is aangesloten op deze computer. Op het apparaat moet MicroPython zijn geflashed voordat het bestandssysteem werkt. Druk ten slotte op de resetknop van het apparaat en wacht een paar seconden voordat u het opnieuw probeert.
ru_ru: Убедитесь, что устройство подключено к этому компьютеру. Чтобы файловая система заработала, на устройстве должен быть установлен MicroPython. Наконец, нажмите кнопку сброса устройства и подождите несколько секунд, прежде чем повторить попытку.
sk_sk: Uistite sa prosím, že je zariadenie pripojené k počítaču. Aby súborový systém fungoval, musí byť na zariadení zapísaný MicroPython. Nakoniec stlačte na zariadení tlačidlo reset a pred ďalším vyskúšaním počkajte niekoľko sekúnd.
uk_ua: Переконайтеся, що пристрій підключено до цього комп’ютера. Перед тим, як файлова система запрацює, на пристрої повинен бути прошитий MicroPython. Нарешті, натисніть кнопку скидання пристрою та зачекайте кілька секунд, перш ніж повторити спробу.
zh_tw: 請確保已將裝置插入此電腦。 在檔案系統工作之前，裝置必須已刷入 MicroPython。 最後，按裝置的重置 (reset) 按鈕並等待幾秒鐘後再重試。

source: {board_name} board
nl: {board_name} bord
ru_ru: Плата {board_name}
sk_sk: doska {board_name}
uk_ua: Плата {board_name}
zh_tw: {board_name} 開發板

source: Write MicroPython directly on Lego Spike devices.
nl: Schrijf MicroPython rechtstreeks op Lego Spike-apparaten.
ru_ru: Запишите MicroPython прямо на устройство Lego Spike.
sk_sk: Programujte zariadenia Lego Spike priamo v jazyku MicroPython.
uk_ua: Напишіть MicroPython безпосередньо на пристроях Lego Spike.
zh_tw: 向 Lego Spike 裝置直接刷入 MicroPython。

source: Write MicroPython for the BBC micro:bit.
nl: Schrijf MicroPython voor de BBC micro:bit.
ru_ru: Запускайте MicroPython на BBC micro:bit.
sk_sk: Programujte BBC micro:bit v jazyku MicroPython.
uk_ua: Запускайте MicroPython на BBC micro:bit.
zh_tw: 為 BBC micro:bit 編寫 MicroPython。

source: Flash
ru_ru: Загрузить
sk_sk: Zapísať
uk_ua: Прошити
zh_tw: 刷入

source: Flash your code onto the micro:bit.
nl: Flash uw code op de micro:bit.
ru_ru: Загрузить ваш код на плату micro:bit.
sk_sk: Zapíše váš kód na micro:bit.
uk_ua: Прошити код на micro:bit.
zh_tw: 將程式碼刷入到 micro:bit 上。

source: Access the file system on the micro:bit.
nl: Open het bestandssysteem op de micro:bit.
ru_ru: Доступ к файловой системе на micro: bit.
sk_sk: Prístup k súborovému systému na zariadení micro:bit.
uk_ua: Доступ до файлової системи на micro:bit.
zh_tw: 存取 micro:bit 上的檔案系統。

source: Use the REPL to live-code on the micro:bit.
nl: Gebruik de REPL om live te coderen op de micro:bit.
ru_ru: Используйте REPL для немедленного выполнения кода на micro:bit.
sk_sk: Spustí živé programovanie (REPL) na zariadení micro:bit.
uk_ua: Використовувати REPL для кодування на micro:bit.
zh_tw: 使用 REPL 在 micro:bit 上即時編寫程式碼。

source: Could not find an attached BBC micro:bit.
nl: Kan een aangesloten BBC micro:bit niet vinden.
ru_ru: Не удалось найти прикрепленную плату BBC micro: bit.
sk_sk: Nepodarilo sa nájsť pripojený BBC micro:bit.
uk_ua: Не вдалося знайти приєднаний пристрій BBC micro:bit..
zh_tw: 找不到已連線的 BBC micro:bit。

source: Please ensure you leave enough time for the BBC micro:bit to be attached and configured correctly by your computer. This may take several seconds. Alternatively, try removing and re-attaching the device or saving your work and restarting Mu if the device remains unfound.
nl: Zorg ervoor dat u voldoende tijd overlaat om de BBC micro:bit te bevestigen en correct te configureren door uw computer. Dit kan enkele seconden duren. U kunt ook proberen het apparaat te verwijderen en opnieuw te bevestigen of uw werk op te slaan en Mu opnieuw te starten als het apparaat niet wordt gevonden.
ru_ru: Пожалуйста, убедитесь, что BBC micro:bit подключён к компьютеру достаточно времени, чтобы система могла его настроить. Это может занять несколько секунд. В качестве альтернативы попробуйте удалить и снова подключить устройство или сохранить свою работу и перезапустить Mu, если устройство не обнаружено.
sk_sk: Uistite sa prosím, že ste nechali dostatok času pre pripojenie a správne nastavenie zariadenia BBC micro:bit vašim počítačom. Môže to trvať niekoľko sekúnd. Prípadne sa pokúste zariadenie znova odpojiť a pripojiť alebo uložte svoju prácu a reštartujte Mu, ak sa zariadenie stále nenašlo.
uk_ua: Будь ласка, переконайтеся, що у вас залишається достатньо часу, щоб його правильно приєднати BBC micro:bit та налаштувати комп'ютер. Це може зайняти кілька секунд. Крім того, спробуйте видалити та повторно підключити пристрій або зберегти свою роботу та перезапустити М'ю, якщо пристрій залишиться без підтвердження.
zh_tw: 請確保你留出了足夠的時間讓你的電腦正確連線和設定 BBC micro:bit 裝置。這可能需要幾秒鐘的時間。或者你可以嘗試儲存檔案並重新連線裝置，如果仍未發現裝置，你還可以嘗試重新啟動 Mu。

source: Cannot save a custom hex file to a local directory.
nl: Kan een aangepast hex-bestand niet opslaan in een lokale map.
ru_ru: Невозможно сохранить пользовательский шестнадцатеричный файл в локальном каталоге.
sk_sk: Nie je možné uložiť vlastný hex súbor do lokálneho priečinku.
uk_ua: Неможливо зберегти нетиповий шістнадцятковий файл до локального каталогу.
zh_tw: 無法將自訂 hex 檔案儲存至本機目錄。

source: When a custom hex file is configured in the settings a local directory cannot be used to save the final hex file.
nl: Wanneer een aangepast hex-bestand is geconfigureerd in de instellingen, kan een lokale map niet worden gebruikt om het uiteindelijke hex-bestand op te slaan.
sk_sk: Ak je v nastaveniach nakonfigurovaný vlastný hex súbor, na uloženie výsledného hex súboru nie je možné použiť lokálny priečinok.
zh_tw: 當在設定中設定了自訂 hex 檔案時，無法使用本機目錄來儲存最終的 hex 檔案。

source: Cannot use a custom hex file without micro:bit port.
nl: Kan geen aangepast hex-bestand gebruiken zonder micro:bit-poort.
ru_ru: Невозможно использовать собственный шестнадцатеричный файл без порта micro:bit.
sk_sk: Nie je možné použiť vlastný hex súbor bez portu na micro:bit.
uk_ua: Неможливо використовувати спеціальний шістнадцятковий файл без порту micro:bit.
zh_tw: 無法在沒有 micro:bit 連接埠的情況下使用自訂 hex 檔案。

source: Mu was unable to detect the micro:bit serial port. Normally this is okay, as Mu can inject the Python code into the hex to flash. However, this cannot be done with a custom hex file.
nl: Mu kon de micro:bit seri�le poort niet detecteren. Normaal gesproken is dit in orde, omdat Mu de Python-code in de hex kan injecteren om te flashen. Dit kan echter niet worden gedaan met een aangepast hex-bestand.
ru_ru: Mu не смог обнаружить последовательный порт micro:bit. Обычно это нормально, поскольку Mu может вставить код Python в шестнадцатеричный код для прошивки. Однако это невозможно сделать с помощью пользовательского шестнадцатеричного файла.
sk_sk: Mu sa nepodarilo zistiť sériový port micro:bit-u. Za normálnych okolností je to v poriadku, pretože Mu môže vložiť kód v jazyku Python do hex súboru na zapísanie. To však nie je možné urobiť s vlastným hex súborom.
uk_ua: М'ю не вдалося виявити послідовний порт micro:bit. Зазвичай це нормально, оскільки М'ю може ввести код Python у HEX для прошивки. Однак, це неможливо зробити з користувацьким файлом HEX.
zh_tw: Mu 無法偵測到 micro:bit 序列埠。通常這沒問題，因為 Mu 可以將 Python 程式碼注入到 hex 檔案中進行刷入。但是，這不能在自訂 hex 檔案中完成。

source: Unsupported BBC micro:bit.
nl: Niet-ondersteunde BBC micro:bit.
ru_ru: Неподдерживаемый BBC micro:bit.
sk_sk: Nepodporovaný BBC micro:bit.
uk_ua: Непідтримуваний BBC micro:bit.
zh_tw: 不支援的 BBC micro:bit。

source: Your device is newer than current version of uflash. Please update uflash to the latest version to support this device.
zh_tw: 你的裝置比此版本的 uflash 更新。請將 uflash 更新到最新版本以支援此裝置。

source: Flashing the micro:bit
nl: De micro:bit flashen
ru_ru: Прошивка micro:bit
sk_sk: Zapisuje sa na micro:bit
uk_ua: Прошивання micro:bit.
zh_tw: 正在刷入到 micro:bit

source: Runtime
ru_ru: Среда выполнения
uk_ua: Середовище виконання
zh_tw: 執行環境

source: Finished flashing.
nl: Klaar met flashen.
ru_ru: Закончена перепрошивка.
sk_sk: Zapisovanie bolo dokončené.
uk_ua: Прошивання закінчено.
zh_tw: 刷入完成。

source: Copied code onto micro:bit.
nl: Code gekopieerd naar micro:bit.
ru_ru: Код скопирован на micro:bit.
sk_sk: Kód bol skopírovaný na micro:bit.
uk_ua: Код скопійовано на micro:bit.
zh_tw: 已將程式碼複製到 micro:bit。

source: There was a problem flashing the micro:bit.
nl: Er is een probleem opgetreden bij het flashen van de micro:bit.
ru_ru: Не удалось прошить micro:bit.
sk_sk: Pri zapisovaní na micro:bit sa vyskytol problém.
uk_ua: Виникла проблема з прошиванням micro:bit.
zh_tw: 刷入程式到 micro:bit 時出現了一個問題。

source: Please do not disconnect the device until flashing has completed. Please check the logs for more information.
nl: Koppel het apparaat niet los voordat het flashen is voltooid. Raadpleeg de logboeken voor meer informatie.
ru_ru: Не отключайте устройство, пока не завершится перепрошивка. Пожалуйста, проверьте логи для получения дополнительной информации.
sk_sk: Prosím neodpájajte zariadenie, pokiaľ nie je zapisovanie ukončené. Ďalšie informácie nájdete v záznamníku.
uk_ua: Будь ласка, не відключайте пристрій, поки прошивання не завершиться. Перевірте журнали для отримання додаткової інформації.
zh_tw: 在刷入完成之前，請不要斷開裝置。請檢視記錄以取得更多資訊。

source: Write MicroPython directly on a Raspberry Pi Pico.
nl: Schrijf MicroPython rechtstreeks op een Raspberry Pi Pico.
ru_ru: Запускайте MicroPython прямо на Raspberry Pi Pico.
sk_sk: Programujte Raspberry Pi Pico priamo v jazyku MicroPython.
uk_ua: Напишіть MicroPython безпосередньо на Raspberry Pi Pico.
zh_tw: 向 Raspberry Pi Pico 直接刷入 MicroPython。

source: Use MicroPython on the Pyboard line of boards.
nl: Gebruik MicroPython op de Pyboard-lijn van boards.
sk_sk: Použite MicroPython na doskách radu Pyboard.
zh_tw: 在 Pyboard 系列開發板上使用 MicroPython。

source: Could not find an attached PyBoard device.
nl: Kon geen aangesloten PyBoard-apparaat vinden.
ru_ru: Не удалось найти подключенное устройство PyBoard.
sk_sk: Nepodarilo sa nájsť pripojené PyBoard zariadenie.
uk_ua: Не вдалося знайти приєднаний пристрій PyBoard.
zh_tw: 找不到已連線的 PyBoard 裝置。

source: Python files for PyBoard MicroPython devices are stored on the device. Therefore, to edit these files you need to have the device plugged in. Until you plug in a device, Mu will use the directory found here: {} ...to store your code.
nl: Python-bestanden voor PyBoard MicroPython-apparaten worden op het apparaat opgeslagen. Om deze bestanden te kunnen bewerken, moet het apparaat daarom zijn aangesloten. Totdat u een apparaat aansluit, gebruikt Mu de map die u hier vindt: {} ...om uw code op te slaan.
ru_ru: Файлы Python для плат PyBoard MicroPython хранятся на устройстве. Следовательно, для редактирования этих файлов вам необходимо подключить устройство. Пока вы не подключите плату, Mu будет использовать каталог, найденный здесь: {} ... для хранения вашего кода.
sk_sk: Python súbory pre PyBoard zariadenia s jazykom MicroPython sú uložené priamo na zariadení. Ak ich chcete upravovať, musíte mať toto zariadenie pripojené. Pokiaľ zariadenie nepripojíte, Mu bude na ukladanie vášho kódu používať priečinok, ktorý nájdete tu: {}
uk_ua: Файли Python для пристроїв PyBoard MicroPython зберігаються на пристрої. Тому для редагування цих файлів потрібно підключити пристрій. Доки ви не підключите пристрій, М'ю використовуватиме каталог, знайдений тут: {} ...для зберігання вашого коду.
zh_tw: PyBoard MicroPython 裝置的 Python 檔案儲存在裝置上。因此，要編輯這些檔案，需要你插入裝置。在插入裝置之前，Mu 將使用這個目錄： {} …來儲存你的程式碼。

source: Make games with Pygame Zero.
nl: Maak spelletjes met Pygame Zero.
ru_ru: Создавайте игры с Pygame Zero.
sk_sk: Vytvárajte hry s knižnicou Pygame Zero.
uk_ua: Створити ігри з Pygame Zero.
zh_tw: 用 Pygame Zero 製作遊戲。

source: Play
nl: Start
ru_ru: Играть
sk_sk: Hrať
uk_ua: Пограти
zh_tw: 開始

source: Play your Pygame Zero game.
nl: Speel je Pygame Zero-spel.
ru_ru: Играть в вашу игру на Pygame Zero.
sk_sk: Spustí vašu Pygame Zero hru.
uk_ua: Пограти у свою гру Pygame Zero.
zh_tw: 開始你的 Pygame Zero 遊戲。

source: Images
nl: Afbeeldingen
ru_ru: Изображения
sk_sk: Obrázky
uk_ua: Зображення
zh_tw: 圖片

source: Show the images used by Pygame Zero.
nl: Laat de afbeeldingen zien die door Pygame Zero worden gebruikt.
ru_ru: Покажите изображения, используемые Pygame Zero.
sk_sk: Zobrazí obrázky používané knižnicou Pygame Zero.
uk_ua: Показати зображення, використані Pygame Zero.
zh_tw: 顯示 Pygame Zero 使用的圖片。

source: Fonts
nl: Lettertypen
ru_ru: Шрифты
sk_sk: Písma
uk_ua: Шрифти
zh_tw: 字型

source: Show the fonts used by Pygame Zero.
nl: Toon de lettertypen die door Pygame Zero worden gebruikt.
ru_ru: Показать шрифты, используемые Pygame Zero.
sk_sk: Zobrazí písma používané knižnicou Pygame Zero.
uk_ua: Показати шрифти, використані Pygame Zero.
zh_tw: 顯示 Pygame Zero 使用的字型。

source: Sounds
nl: Geluiden
ru_ru: Звуки
sk_sk: Zvuky
uk_ua: Звуки
zh_tw: 音效

source: Show the sounds used by Pygame Zero.
nl: Laat de geluiden zien die door Pygame Zero worden gebruikt.
ru_ru: Показать звуки, используемые Pygame Zero.
sk_sk: Zobrazí zvuky používané knižnicou Pygame Zero.
uk_ua: Показати звуки, які використовує Pygame Zero.
zh_tw: 顯示 Pygame Zero 使用的音效。

source: Music
nl: Muziek
ru_ru: Музыка
sk_sk: Hudba
uk_ua: Музика
zh_tw: 音樂

source: Show the music used by Pygame Zero.
nl: Laat de muziek zien die door Pygame Zero wordt gebruikt.
ru_ru: Показать музыку, используемую Pygame Zero.
sk_sk: Zobrazí hudbu používanú knižnicou Pygame Zero.
uk_ua: Показати музику, яку використовує Pygame Zero.
zh_tw: 顯示 Pygame Zero 使用的音樂。

source: Stop your Pygame Zero game.
nl: Stop je Pygame Zero-spel.
ru_ru: Остановите игру Pygame Zero.
sk_sk: Zastaví vašu Pygame Zero hru.
uk_ua: Зупинити гру Pygame Zero.
zh_tw: 停止你的 Pygame Zero 遊戲。

source: Create code using standard Python 3.
nl: Maak code met behulp van standaard Python 3.
ru_ru: Пишите код, используя стандартный Python 3.
sk_sk: Programujte pomocou štandardného Python 3.
uk_ua: Створити код за допомогою стандартного Python 3.
zh_tw: 使用標準 Python 3 編寫程式碼。

source: Run your Python script.
nl: Voer uw Python-script uit.
ru_ru: Запустите свой скрипт Python.
sk_sk: Spustí váš skript v jazyku Python.
uk_ua: Запустити скрипт Python.
zh_tw: 執行你的 Python 腳本。

source: Debug
nl: Debuggen
ru_ru: Отладить
sk_sk: Ladiť
uk_ua: Відлагодити
zh_tw: 偵錯

source: Debug your Python script.
nl: Debug uw Python-script.
ru_ru: Отладьте свой скрипт Python.
sk_sk: Ladiť váš skript v jazyku Python.
uk_ua: Налагодження скрипту Python.
zh_tw: 偵錯你的 Python 腳本。

source: Use the REPL for live coding.
nl: Gebruik de REPL voor live codering.
ru_ru: Используйте REPL для немедленного исполнения кода.
sk_sk: Spustí REPL na živé programovanie.
uk_ua: Використати REPL для прямого кодування.
zh_tw: 用 REPL 進行即時程式設計。

source: Plot data from your script or the REPL.
nl: Plot gegevens uit uw script of de REPL.
ru_ru: Постройте график по данным из вашего скрипта или REPL.
sk_sk: Vykresliť údaje z vášho skriptu alebo REPL.
uk_ua: Побудова даних зі свого скрипту або REPL.
zh_tw: 從你的腳本或 REPL 的繪製資料。

source: Stop your Python script.
nl: Stop je Python-script.
ru_ru: Остановить выполнение вашего Python скрипта.
sk_sk: Zastaviť váš skript v jazyku Python.
uk_ua: Зупинити свій скрипт Python.
zh_tw: 停止你的 Python 腳本。

source: Starting iPython REPL.
nl: iPython REPL starten.
ru_ru: Запуск iPython REPL.
sk_sk: Spúšťa sa iPython REPL.
uk_ua: Запуск iPython REPL.
zh_tw: 正在啟動 iPython REPL。

source: Stopping iPython REPL (this may take a short amount of time).
nl: iPython REPL stoppen (dit kan even duren).
ru_ru: Остановка iPython REPL (это может занять некоторое время).
sk_sk: Zastavuje sa iPython REPL (môže to chvíľu trvať).
uk_ua: Зупинка iPython REPL (це може зайняти деякий час).
zh_tw: 正在停止 iPython REPL （可能需要一點點時間）。

source: REPL started.
nl: REPL gestart.
ru_ru: REPL запущен.
sk_sk: REPL bol spustený.
uk_ua: REPL запущено.
zh_tw: REPL 已啟動。

source: REPL stopped.
nl: REPL gestopt.
ru_ru: REPL остановлен.
sk_sk: REPL bol zastavený.
uk_ua: REPL зупинено.
zh_tw: REPL 已停止。

source: Write code for boards running Snek.
nl: Schrijf code voor boards waarop Snek draait.
zh_tw: 為執行 Snek 的開發板編寫程式碼。

source: Put
nl: Opzetten
zh_tw: 上傳

source: Put the current program to the device.
nl: Zet het huidige programma op het apparaat.
zh_tw: 將目前程式上傳到裝置。

source: Get
nl: Afhalen
zh_tw: 下載

source: Get the current program from the device.
nl: Haal het huidige programma van het apparaat.
zh_tw: 從裝置下載目前程式。

source: There is un-saved work, 'get' will cause you to lose it.
nl: Er is niet-opgeslagen werk, 'afhalen' zorgt ervoor dat je het kwijtraakt.
zh_tw: 你有還沒有儲存的程式碼，「下載」將導致你遺失它。

source: Please make sure the device is plugged into this computer. It must have a version of Snek flashed onto it before the REPL will work. Finally, press the device's reset button and wait a few seconds before trying again.
nl: Zorg ervoor dat het apparaat is aangesloten op deze computer. Er moet een versie van Snek op geflasht zijn voordat de REPL werkt. Druk ten slotte op de resetknop van het apparaat en wacht een paar seconden voordat u het opnieuw probeert.
zh_tw: 請確保已將裝置插入這台電腦。 在 REPL 工作之前，裝置必須有一個 Snek 版本的韌體已經刷入。 最後，按一下裝置的重置 (reset) 按鈕並等待幾秒鐘後再重試。

source: Web
ru_ru: Веб
uk_ua: Веб
zh_tw: 網頁

source: Build simple websites with the "Flask" web framework.
nl: Bouw eenvoudige websites met het webframework "Flask".
ru_ru: Создавайте простые веб-сайты с помощью веб-фреймворка Flask.
sk_sk: Vytvárajte jednoduché webové stránky so softvérovým rámcom "Flask".
uk_ua: Створюйте прості вебсайти за допомогою вебфреймворку "Flask".
zh_tw: 使用 Flask Web 框架建置簡單的網頁。
