Repository: blackteahamburger/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: nl, ru_ru, sk_sk, uk_ua, zh_tw

source: Error saving file to disk. Ensure you have permission to write the file and sufficient disk space.
nl: Fout bij opslaan van bestand op schijf. Zorg ervoor dat u toestemming hebt om het bestand te schrijven en dat u voldoende schijfruimte hebt.
ru_ru: Ошибка при сохранении файла на диск. Убедитесь, что у вас есть разрешение на запись и на диске достаточно места.
sk_sk: Pri ukladaní súboru na disk došlo ku chybe. Uistite sa, že máte právo na zápis súboru a dostatok miesta na disku.
uk_ua: Помилка збереження файлу на диску. Переконайтеся, що у вас є дозвіл на запис файлу та достатньо місця на диску.
zh_tw: 將檔案儲存到磁碟時出錯。確保你有寫入檔案的權限和足夠的磁碟空間。

source: Could not save file (encoding problem)
nl: Kon het bestand niet opslaan (coderingsprobleem)
ru_ru: Не удалось сохранить файл (проблема с кодировкой)
sk_sk: Nepodarilo sa uložiť súbor (problém s kódovaním)
uk_ua: Не вдалося зберегти файл (проблема кодування)
zh_tw: 無法儲存檔案（編碼問題）

source: Unable to convert all the characters. If you have an encoding line at the top of the file, remove it and try again.
nl: Niet in staat om alle tekens te converteren. Als er een coderingsregel bovenaan het bestand staat, verwijder deze dan en probeer het opnieuw.
ru_ru: Невозможно преобразовать все символы. Если у вас есть строка кодировки в верхней части файла, удалите ее и повторите попытку.
sk_sk: Nie je možné konvertovať všetky znaky. Ak máte v prvom riadku súboru uvedené kódovania, odstráňte ho a skúste to znova.
uk_ua: Неможливо конвертувати всі символи. Якщо у верхній частині файлу є рядок кодування, видаліть його та спробуйте ще раз.
zh_tw: 無法轉換所有字元。如果檔案頂部有編碼行，請將其刪除並重試。

source: Saved file: {}
nl: Opgeslagen bestand: {}
ru_ru: Сохранённый файл: {}
sk_sk: Uložený súbor: {}
uk_ua: Збережений файл: {}
zh_tw: 已儲存檔案：{}

source: You cannot use the filename "{}"
nl: U kunt de bestandsnaam "{}" niet gebruiken
ru_ru: Вы не можете назвать файл "{}"
sk_sk: Nemôžete použiť "{}" ako názov súboru
uk_ua: Ви не можете використовувати назву файла "{}"
zh_tw: 你不能使用檔名「{}」

source: This name is already used by another part of Python. If you use this name, things are likely to break. Please try again with a different filename.
nl: Deze naam wordt al gebruikt door een ander deel van Python. Als u deze naam gebruikt, is de kans groot dat er dingen kapot gaan. Probeer het opnieuw met een andere bestandsnaam.
ru_ru: Это имя уже используется другой частью Python. Если вы используете это имя, все может сломаться. Пожалуйста, попробуйте еще раз с другим именем файла.
sk_sk: Tento názov už používa iná časť jazyka Python. Ak ho použijete, je veľmi pravdepodobné, že sa niektoré veci pokazia. Skúste to prosím znova s iným názvom súboru.
uk_ua: Цю назву вже використовує інша частина Python. Якщо ви будете використовувати це ім'я, код, ймовірно, зіпсується. Спробуйте ще раз з іншим іменем файлу.
zh_tw: 這個名稱已被 Python 的另一部分使用。如果你使用這個名稱，可能會出問題。請使用其他檔名重試。

source: Good job! No problems found.
nl: Goed gedaan! Geen problemen gevonden.
ru_ru: Отлично! Проблем не обнаружено.
sk_sk: Dobrá práca! Neboli nájdené žiadne problémy.
uk_ua: Молодець! Проблем не знайдено.
zh_tw: 幹得漂亮！沒有發現問題。

source: Hurrah! Checker turned up no problems.
nl: Hoera! De controle leverde geen problemen op.
ru_ru: Ура! Проверка не обнаружила никаких проблем.
sk_sk: Hurá! Kontrola nehlási žiadne problémy.
uk_ua: Ура! Перевірка не виявила проблем.
zh_tw: 誒嘿！檢查結果顯示，沒有問題。

source: Nice one! Zero problems detected.
nl: Goed zo! Nul problemen gedetecteerd.
ru_ru: Хорошо! Не обнаружено никаких проблем.
sk_sk: Pekne! Nebol zistený žiadny problém.
uk_ua: Чудово! Не виявлено жодної проблеми.
zh_tw: 棒！偵測到 0 個問題。

source: Well done! No problems here.
nl: Goed gedaan! Geen problemen hier.
ru_ru: Отличная работа! Тут проблем нет.
sk_sk: Výborne! Bez problémov.
uk_ua: Молодець! Тут проблем немає.
zh_tw: 做得好！這裡沒問題。

source: Awesome! Zero problems found.
nl: Geweldig! Nul problemen gevonden.
ru_ru: Превосходно! Найдено ноль проблем.
sk_sk: Úžasné! Nula nájdených problémov.
uk_ua: Дивовижно! Не знайдено жодної проблеми.
zh_tw: 真棒！偵測到 0 個問題。

source: There is un-saved work, exiting the application will cause you to lose it.
nl: Er is niet-opgeslagen werk, als u de toepassing stopt, raakt u het kwijt.
ru_ru: Есть несохраненная работа, выход из приложения приведет к ее потере.
sk_sk: Vaša práca nie je uložená. Ukončením aplikácie ju stratíte.
uk_ua: Роботу не збережено, вихід із програми призведе до її втрати.
zh_tw: 你有未儲存的程式碼，結束程式將導致其遺失。

source: Could not find MicroPython runtime.
nl: Kan de MicroPython-runtime niet vinden.
ru_ru: Не удалось найти среду выполнения MicroPython.
sk_sk: Nepodarilo sa nájsť runtime pre MicroPython.
uk_ua: Не вдалося знайти MicroPython.
zh_tw: 找不到 MicroPython 執行環境。

source: The micro:bit runtime you specified ('{}') does not exist. Please try again.
nl: De micro:bit runtime die je hebt opgegeven ('{}') bestaat niet. Probeer het opnieuw.
ru_ru: Указанная вами среда выполнения micro:bit ('{}') не существует. Пожалуйста, попробуйте еще раз.
sk_sk: Runtime pre micro:bit, ktorý ste špecifikovali ('{}'), neexistuje. Skúste to prosím znova.
uk_ua: Код micro:bit, який ви вказали ('{}'), не існує. Будь ласка спробуйте ще раз.
zh_tw: 你指定的 micro:bit 執行環境（「{}」）不存在。請再試一次。

source: Changed to {} mode.
nl: Gewijzigd in {} modus.
ru_ru: Режим работы изменён на {}.
sk_sk: Režim bol zmenený na {}.
uk_ua: Змінено на режим {}.
zh_tw: 已變更為 {} 模式。

source: Would you like to change Mu to the {} mode?
nl: Wil je Mu veranderen in de {} modus?
ru_ru: Вы хотите переключить Mu в режим {}?
sk_sk: Chcete zmeniť režim Mu na {}?
uk_ua: Бажаєте змінити режим М'ю на {}?
zh_tw: 你想將 Mu 改為 {} 模式嗎？

source: Device changed to {}.
nl: Apparaat gewijzigd in {}.
ru_ru: Устройство изменено на {}.
sk_sk: Zariadenie bolo zmenené na {}.
uk_ua: Пристрій змінено на {}.
zh_tw: 裝置變更為 {}。

source: Cannot Set Breakpoint.
nl: Kan onderbreekpunt niet instellen.
zh_tw: 無法設定中斷點。

source: Lines that are comments or some multi-line statements cannot have breakpoints.
nl: Regels die opmerkingen zijn of sommige instructies met meerdere regels mogen geen onderbrekingspunten hebben.
zh_tw: 註解行或某些多行陳述式無法設定中斷點。

source: This name is already used by another part of Python. If you use that name, things are likely to break. Please try again with a different filename.
nl: Deze naam wordt al gebruikt door een ander deel van Python. Als je die naam gebruikt, is de kans groot dat er dingen kapot gaan. Probeer het opnieuw met een andere bestandsnaam.
ru_ru: Это имя уже используется другой частью Python. Если вы используете это имя, все может сломаться. Пожалуйста, попробуйте еще раз с другим именем файла.
sk_sk: Tento názov už používa iná časť jazyka Python. Ak ho použijete, je veľmi pravdepodobné, že sa niektoré veci pokazia. Skúste to prosím znova s iným názvom súboru.
uk_ua: Цю назву вже використовує інша частина Python. Якщо ви будете використовувати це ім'я, код, ймовірно, зіпсується. Спробуйте ще раз з іншим іменем файлу.
zh_tw: 這個名稱已被 Python 的另一部分使用。如果你使用這個名稱，可能會出問題。請使用其他檔名重試。

source: Could not rename file.
nl: Kan de naam van het bestand niet wijzigen.
ru_ru: Невозможно переименовать файл.
sk_sk: Súbor sa nepodarilo premenovať.
uk_ua: Не вдалося перейменувати файл.
zh_tw: 無法重新命名檔案。

source: A file of that name is already open in Mu.
nl: Een bestand met die naam is al geopend in Mu.
ru_ru: Файл с таким именем уже открыт в Mu.
sk_sk: Súbor s týmto názvom je už v Mu otvorený.
uk_ua: Файл з такою назвою вже відкрито в М'ю.
zh_tw: 該名稱的檔案已在 Mu 中開啟。

source: Replaced "{}" with "{}".
nl: "{}" vervangen door "{}".
ru_ru: Заменено "{}" на "{}".
sk_sk: "{}" bolo nahradené s "{}".
uk_ua: Замінено "{}" на "{}".
zh_tw: 已將「{}」取代為「{}」。

source: Replaced {} matches of "{}" with "{}".
nl: {} overeenkomsten van "{}" vervangen door "{}".
ru_ru: Заменены {} совпадения "{}" на "{}".
sk_sk: Nahradených {} zhôd výrazu "{}" výrazom "{}".
uk_ua: Замінено {} збігів "{}" на "{}".
zh_tw: 已將 {} 個「{}」的符合項取代為「{}」。

source: Could not find "{}".
nl: Kon niet vinden "{}".
ru_ru: Невозможно найти "{}".
sk_sk: Nepodarilo sa nájsť "{}".
uk_ua: Не вдалося знайти "{}".
zh_tw: 找不到「{}」。

source: Highlighting matches for "{}".
nl: Overeenkomsten markerend voor "{}".
ru_ru: Выделены совпадения для "{}".
sk_sk: Zvýrazňujú sa zhody pre "{}".
uk_ua: Підсвічування збігів для "{}".
zh_tw: 反白顯示「{}」的符合項。

source: You must provide something to find.
nl: Je moet iets aanbieden om te vinden.
ru_ru: Вы должны указать что искать.
sk_sk: Pre vyhľadávanie musíte niečo zadať.
uk_ua: Ви повинні вказати щось, щоб знайти.
zh_tw: 你需要輸入要尋找的內容。

source: Please try again, this time with something in the find box.
nl: Probeer het opnieuw, deze keer met iets in het zoekvak.
ru_ru: Пожалуйста, попробуйте еще раз, на этот раз с каким-нибудь значением в поле поиска.
sk_sk: Skúste to prosím znova, ale tentoraz s niečím v poli pre vyhľadávanie.
uk_ua: Спробуйте ще раз, цього разу з чимось у вікні пошуку.
zh_tw: 請在尋找方塊中輸入內容，然後重試。

source: Successfully cleaned the code. Use CTRL-Z to undo.
nl: De code is met succes opgeschoond. Gebruik CTRL-Z om ongedaan te maken.
ru_ru: Код успешно отформатирован. Для отмены используйте CTRL-Z.
sk_sk: Kód bol úspešne uprataný. Stlačte CTRL-Z pre vrátenie zmien.
uk_ua: Код успішно очищено. Використовуйте Ctrl-Z для скасування.
zh_tw: 成功清理程式碼。按 CTRL-Z 以復原。

source: Your code contains problems.
nl: Uw code bevat problemen.
ru_ru: В вашем коде есть проблемы.
sk_sk: Váš kód obsahuje chyby.
uk_ua: Ваш код містить проблеми.
zh_tw: 你的程式碼包含錯誤。

source: These must be fixed before tidying will work. Please use the 'Check' button to highlight these problems.
nl: Deze moeten worden gerepareerd voordat het opruimen gaat werken. Gebruik de knop 'Controleren' om deze problemen te markeren.
ru_ru: Их необходимо исправить, прежде чем начнется автоматическое форматирование. Пожалуйста, используйте кнопку «Проверить», чтобы найти и подсветить эти проблемы.
sk_sk: Tieto musia byť opravené ešte predtým, než bude upratovanie fungovať. Ak chcete tieto chyby zvýrazniť, použite tlačidlo "Skontrolovať".
uk_ua: Вони повинні бути виправлені, перш ніж форматування буде працювати. Використовуйте кнопку 'Перевірити', щоб виділити ці проблеми.
zh_tw: 這些錯誤必須在格式化之前修正。請使用「檢查」按鈕以反白顯示這些錯誤。

source: Cannot connect to device on port {}
nl: Kan geen verbinding maken met apparaat op poort {}
ru_ru: Не удается подключиться к устройству через порт {}
sk_sk: Nepodarilo sa pripojiť k zariadeniu na porte {}
uk_ua: Неможливо підключитися до пристрою на порту {}
zh_tw: 無法在 {} 連接埠上連線裝置

source: # Write your code here :-)
nl: # Schrijf hier je code :-)
ru_ru: # Напишите здесь свой код :-)
sk_sk: # Tu napíšte svoj kód :-)
uk_ua: # Напишіть свій код тут :-)
zh_tw: # 在這裡寫上你的程式碼 :-)

source: Data Flood Detected!
nl: Gegevensoverstroming gedetecteerd!
ru_ru: Обнаружен спам данными!
sk_sk: Bola zistená záplava údajmi!
uk_ua: Виявлено 'потоп' даних!
zh_tw: 偵測到資料氾濫！

source: The plotter is flooded with data which will make Mu unresponsive and freeze. As a safeguard, the plotter has been stopped. Flooding is when chunks of data of more than 1024 bytes are repeatedly sent to the plotter. To fix this, make sure your code prints small tuples of data between calls to 'sleep' for a very short period of time.
nl: De plotter wordt overspoeld met gegevens waardoor Mu niet meer reageert en vastloopt. Als beveiliging is de plotter gestopt. Overstromingen zijn wanneer stukjes data van meer dan 1024 bytes herhaaldelijk naar de plotter worden gestuurd. Om dit op te lossen, moet je ervoor zorgen dat je code kleine tuples met gegevens afdrukt tussen aanroepen om te 'slapen' voor een zeer korte periode.
ru_ru: Плоттер переполнен данными, из-за которых Mu перестает отвечать на запросы и зависает. В качестве меры предосторожности плоттер был остановлен. Спам данными - это когда на плоттер повторно отправляются блоки данных размером более 1024 байтов. Чтобы исправить это, убедитесь, что ваш код печатает небольшие кортежи данных, а между вызовами "print()" есть вызовы "time.sleep()" с очень маленькими значениями в качестве аргумента.
sk_sk: Ploter je zaplavený údajmi, ktoré spôsobia, že Mu prestane reagovať a zamrzne. Z bezpečnostných dôvodov bol preto zapisovač zastavený. K záplave dochádza vtedy, keď sa do zapisovača opakovane odosielajú časti údajov s veľkosťou viac ako 1024 bajtov. Ak chcete tento problém odstrániť, uistite sa, že váš kód vypisuje malé n-tice údajov medzi volaniami funkcie na uspatie na veľmi krátky čas.
uk_ua: Плотер 'затоплений' даними, які змусять М'ю не реагувати і 'замерзнути'. Як запобіжний засіб, плотер було зупинено. 'Затоплення' - це випадки, коли шматки даних з більш ніж 1024 байтами неодноразово надсилаються на плотер. Щоб виправити це, переконайтеся, що ваш код друкує невеликі кортежі даних між дзвінками до 'сну' протягом дуже короткого періоду часу.
zh_tw: 繪圖器已經資料氾濫，這將使 Mu 無回應並卡死。作為一種保護措施，繪圖器已經停止。 氾濫是指不停的傳送超過 1024 位元組的大量資料到繪圖器。 要解決此問題，請確保你的程式碼在列印小的元組 (tuple) 資料的間隔中，呼叫非常短時間的「sleep」函式。

source: Click on the device's reset button, wait a few seconds and then try again.
nl: Klik op de resetknop van het apparaat, wacht een paar seconden en probeer het opnieuw.
ru_ru: Нажмите кнопку сброса на устройстве, подождите несколько секунд и повторите попытку.
sk_sk: Stlačte reset tlačidlo na vašom zariadení, počkajte pár sekúnd a skúste to znova.
uk_ua: Натисніть кнопку скидання пристрою, зачекайте кілька секунд і повторіть спробу.
zh_tw: 按一下裝置的重置 (reset) 按鈕，等待幾秒鐘，然後重試。

source: Could not find an attached device.
nl: Kan een aangesloten apparaat niet vinden.
ru_ru: Не удалось найти подключенное устройство.
sk_sk: Nepodarilo sa nájsť pripojené zariadenie.
uk_ua: Не вдалося знайти приєднаний пристрій.
zh_tw: 找不到已連線的裝置。

source: Please make sure the device is plugged into this computer. It must have a version of MicroPython (or CircuitPython) flashed onto it before the REPL will work. Finally, press the device's reset button and wait a few seconds before trying again.
nl: Zorg ervoor dat het apparaat is aangesloten op deze computer. Er moet een versie van MicroPython (of CircuitPython) op geflashed zijn voordat de REPL werkt. Druk ten slotte op de resetknop van het apparaat en wacht een paar seconden voordat u het opnieuw probeert.
ru_ru: Убедитесь, что устройство подключено к этому компьютеру. Прежде чем REPL заработает, на устройстве должна быть установлена версия MicroPython (или CircuitPython). Наконец, нажмите кнопку сброса устройства и подождите несколько секунд, прежде чем повторить попытку.
sk_sk: Uistite sa prosím, že je zariadenie pripojené k tomuto počítaču. Predtým, ako bude REPL fungovať, musí byť na zariadení zapísaný MicroPython (alebo CircuitPython). Nakoniec stlačte na zariadení tlačidlo reset, počkajte niekoľko sekúnd a skúste to znova.
uk_ua: Переконайтеся, що пристрій підключено до цього комп’ютера. На ньому повинна бути прошита версія MicroPython (або CircuitPython), перш ніж REPL запрацює. Нарешті, натисніть кнопку скидання пристрою та зачекайте кілька секунд, перш ніж повторити спробу.
zh_tw: 請確保已將裝置插入這台電腦。 在 REPL 工作之前，裝置必須有一個 MicroPython 或 CircuitPython 版本的韌體已經刷入。 最後，按一下裝置的重置 (reset) 按鈕並等待幾秒鐘後再重試。

source: Please make sure the device is plugged into this computer. It must have a version of MicroPython (or CircuitPython) flashed onto it before the Plotter will work. Finally, press the device's reset button and wait a few seconds before trying again.
nl: Zorg ervoor dat het apparaat is aangesloten op deze computer. Er moet een versie van MicroPython (of CircuitPython) op geflashed zijn voordat de plotter zal werken. Druk ten slotte op de resetknop van het apparaat en wacht een paar seconden voordat u het opnieuw probeert.
ru_ru: Убедитесь, что устройство подключено к этому компьютеру. Прежде чем плоттер заработает, на устройстве должна быть установлена версия MicroPython (или CircuitPython). Наконец, нажмите кнопку сброса устройства и подождите несколько секунд, прежде чем повторить попытку.
sk_sk: Uistite sa prosím, že je zariadenie pripojené k tomuto počítaču. Predtým, ako bude ploter fungovať, musí byť na zariadení zapísaný MicroPython (alebo CircuitPython). Nakoniec stlačte na zariadení tlačidlo reset, počkajte niekoľko sekúnd a skúste to znova.
uk_ua: Переконайтеся, що пристрій підключено до цього комп’ютера. Він повинен мати версію MicroPython (або CircuitPython), що прошивається на ньому, перш ніж Plotter запрацює. Нарешті, натисніть кнопку скидання пристрою та зачекайте кілька секунд, перш ніж повторити спробу.
zh_tw: 請確保已將裝置插入這台電腦。 在繪圖器工作之前，裝置必須有一個 MicroPython 或 CircuitPython 版本的韌體已經刷入。 最後，按一下裝置的重置 (reset) 按鈕並等待幾秒鐘後再重試。

source: Write code for boards running CircuitPython.
nl: Schrijf code voor borden met CircuitPython.
ru_ru: Пишите код для плат, на которых работает CircuitPython.
sk_sk: Programujte dosky, na ktorých beží CircuitPython.
uk_ua: Напишіть код для плат, на яких працює CircuitPython.
zh_tw: 為執行 CircuitPython 的開發板編寫程式碼。

source: Serial
nl: Serieel
ru_ru: Последовательный
sk_sk: Sériová linka
uk_ua: Послідовний
zh_tw: 序列埠

source: Open a serial connection to your device.
nl: Open een seri�le verbinding met uw apparaat.
ru_ru: Откройте последовательное соединение с вашим устройством.
sk_sk: Otvorí spojenie cez sériovú linku s vašim zariadením.
uk_ua: Відкрийте послідовне з'єднання зі своїм пристроєм.
zh_tw: 開啟與裝置的序列埠連線。

source: Plotter
ru_ru: Плоттер
sk_sk: Ploter
uk_ua: Плотер
zh_tw: 繪圖器

source: Plot incoming REPL data.
nl: Plot inkomende REPL-gegevens.
ru_ru: Постройте входящие данные REPL.
sk_sk: Vykreslí prichádzajúce údaje z REPL.
uk_ua: Побудова вхідних даних REPL.
zh_tw: 繪製由 REPL 傳入的資料。

source: Permission error running mount command
nl: Toestemmingsfout bij het plaatsen van de opdracht
ru_ru: Ошибка разрешения при выполнении команды монтирования
sk_sk: Chyba povolenia pri spustení príkazu mount
uk_ua: Помилка дозволу під час запуску команди mount
zh_tw: 執行掛載命令時遇到權限錯誤。

source: The mount command ("{}") returned an error: {}. Mu will continue as if a device isn't plugged in.
nl: Het plaatsings-commando ("{}") heeft een fout geretourneerd: {}. Mu gaat verder alsof een apparaat niet is aangesloten.
ru_ru: Команда монтирования ("{}") вернула ошибку: {}. Mu продолжит работу, как если бы устройство не было подключено.
sk_sk: Príkaz pre pripojenie ("{}") vrátil chybu: {}. Mu bude pokračovať, ako keby zariadenie nebolo pripojené.
uk_ua: Команда монтування ("{}") повернула помилку: {}. М'ю продовжуватиме працювати так, ніби пристрій не підключено до мережі.
zh_tw: 掛載命令（「{}」）傳回了一個錯誤：{}。Mu 將假設裝置未連線。

source: If your Circuit Python device is plugged in, you need to "Share with Linux" on the CIRCUITPY drive in the "Files" app then restart Mu.
nl: Als uw Circuit Python-apparaat is aangesloten, moet u "Delen met Linux" op de CIRCUITPY-schijf in de app "Bestanden" en vervolgens Mu opnieuw opstarten.
ru_ru: Если ваше устройство Circuit Python подключено, вам нужно «Поделиться с Linux» на диске CIRCUITPY в приложении «Файлы», а затем перезапустить Mu.
uk_ua: Якщо пристрій Circuit Python підключено, потрібно "Поділитися з Linux" на диску CIRCUITPY у додатку "Файли", а потім перезапустити М'ю.
zh_tw: 如果你的 CircuitPython 裝置已插入，你需要在「檔案 (Files)」應用中把 CIRCUITPY 磁碟機「與 Linux 共享 (Share with Linux)」，然後重新啟動 Mu。

source: Could not find an attached CircuitPython device.
nl: Kan een aangesloten CircuitPython-apparaat niet vinden.
ru_ru: Не удалось найти подключенное устройство с CircuitPython.
sk_sk: Nepodarilo sa nájsť pripojené CircuitPython zariadenie.
uk_ua: Не вдалося знайти приєднаний пристрій CircuitPython.
zh_tw: 找不到已連線的 CircuitPython 裝置。

source: Python files for CircuitPython devices are stored on the device. Therefore, to edit these files you need to have the device plugged in. Until you plug in a device, Mu will use the directory found here: {} ...to store your code.
nl: Python-bestanden voor CircuitPython-apparaten worden op het apparaat opgeslagen. Om deze bestanden te kunnen bewerken, moet het apparaat daarom zijn aangesloten. Totdat u een apparaat aansluit, gebruikt Mu de map die u hier vindt: {} ...om uw code op te slaan.
ru_ru: Файлы Python для устройств CircuitPython хранятся на устройстве. Следовательно, для редактирования этих файлов вам необходимо подключить устройство. Пока вы не подключите устройство, Mu будет использовать каталог, найденный здесь: {} ... для хранения вашего кода.
sk_sk: Python súbory pre CircuitPython zariadenia sú uložené priamo na zariadení. Ak ich chcete upravovať, musíte mať toto zariadenie pripojené. Pokiaľ zariadenie nepripojíte, Mu bude na ukladanie vášho kódu používať priečinok, ktorý nájdete tu: {}
uk_ua: Файли Python для пристроїв CircuitPython зберігаються на пристрої. Тому для редагування цих файлів потрібно підключити пристрій. Доки ви не підключите пристрій, М'ю використовуватиме каталог, знайдений тут: {} ...для зберігання вашого коду.
zh_tw: CircuitPython 裝置的 Python 檔案儲存在裝置上。因此，要編輯這些檔案，需要你插入裝置。在插入裝置之前，Mu 將使用這個目錄： {} …來儲存你的程式碼。

source: Graphical Debugger
nl: Grafische debugger
ru_ru: Графический Отладчик
sk_sk: Grafické ladenie
uk_ua: Графічний налагоджувач
zh_tw: 圖形化偵錯器

source: Debug your Python 3 code.
nl: Debug uw Python 3-code.
ru_ru: Отладьте свой код Python 3.
sk_sk: Ladiť váš Python 3 kód.
uk_ua: Налагодити код Python 3.
zh_tw: 偵錯你的 Python 3 程式碼。

source: Stop
ru_ru: Остановить
sk_sk: Zastaviť
uk_ua: Зупинити
zh_tw: 停止

source: Stop the running code.
nl: Stop de lopende code.
ru_ru: Остановить запущенный код.
sk_sk: Zastaví spustený kód.
uk_ua: Зупиніть працюючий код.
zh_tw: 停止執行程式碼。

source: Continue
nl: Doorgaan
ru_ru: Продолжить
sk_sk: Pokračovať
uk_ua: Продовжити
zh_tw: 繼續

source: Continue to run your Python script.
nl: Ga door met het uitvoeren van uw Python-script.
ru_ru: Продолжить выполнение скрипта.
sk_sk: Pokračovať vo vašom Python skripte.
uk_ua: Продовжити виконувати скрипт Python.
zh_tw: 繼續執行你的 Python 腳本。

source: Step Over
nl: Overstappen
ru_ru: Пропустить
uk_ua: Крок вперед
zh_tw: 單步

source: Step over a line of code.
nl: Stap over een regel code.
ru_ru: Пропустить строку кода.
uk_ua: Пропустити рядок коду.
zh_tw: 單步一行程式碼。

source: Step In
nl: Stap in
ru_ru: Шаг с заходом
sk_sk: Vstúpiť
uk_ua: Крок із входом
zh_tw: 步入

source: Step into a function.
nl: Stap in een functie.
ru_ru: Шагнуть в функцию.
sk_sk: Vstúpi do funkcie.
uk_ua: Крок у середину функції.
zh_tw: 步入一個函式。

source: Step Out
nl: Uitstappen
ru_ru: Шаг с выходом
sk_sk: Vystúpiť
uk_ua: Крок з виходом
zh_tw: 步出

source: Step out of a function.
nl: Stap uit een functie.
ru_ru: Выйти из функции.
sk_sk: Vystúpi z funkcie.
uk_ua: Крок з виходом із функції.
zh_tw: 步出一個函式。

source: Your script has finished running.
nl: Uw script is voltooid.
ru_ru: Ваш скрипт завершен.
sk_sk: Beh vášho skriptu sa skončil.
uk_ua: Ваш скрипт закінчився.
zh_tw: 你的腳本已完成執行。

source: Unable to connect to the Python debugger.
nl: Kan geen verbinding maken met de Python-foutopsporing.
ru_ru: Невозможно подключиться к отладчику Python.
sk_sk: Nepodarilo sa pripojiť k ladiacemu programu jazyka Python.
uk_ua: Не вдається підключитися до налагоджувача Python.
zh_tw: 無法連線到 Python 偵錯器。

source: Debugger info: {}
nl: Foutopsporingsinformatie: {}
ru_ru: Информация отладчика: {}
uk_ua: Інформація налагоджувача: {}
zh_tw: 偵錯器資訊：{}

source: Debugger warning: {}
nl: Foutopsporingswaarschuwing: {}
ru_ru: Предупреждение отладчика: {}
uk_ua: Попередження налагоджувача: {}
zh_tw: 偵錯器警告：{}

source: Debugger error: {}
nl: Foutopsporingsfout: {}
ru_ru: Ошибка отладчика: {}
uk_ua: Помилка налагодження: {}
zh_tw: 偵錯器錯誤：{}

source: Write MicroPython on ESP8266/ESP32 boards.
nl: Schrijf MicroPython op ESP8266/ESP32-kaarten.
ru_ru: Запускайте MicroPython на платах ESP8266/ESP32.
sk_sk: Programujte v jazyku MicroPython na doskách ESP8266/ESP32.
uk_ua: Запускайте MicroPython на платах ESP8266/ESP32.
zh_tw: 向 ESP8266/ESP32 開發板刷入 MicroPython。
