Repository: blackteahamburger/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: nl, ru_ru, sk_sk, uk_ua, zh_tw

source: Run the web server.
nl: Start de webserver.
ru_ru: Запустите веб-сервер.
sk_sk: Spustí webový server.
uk_ua: Запустити вебсервер.
zh_tw: 執行網頁伺服器。

source: Deploy
zh_tw: 部署

source: Deploy website to PythonAnywhere.
zh_tw: 將網站部署到 PythonAnywhere。

source: Open your website in a browser.
nl: Open uw website in een browser.
ru_ru: Откройте свой сайт в браузере.
sk_sk: Otvorí vašu webovú stránku v prehliadači.
uk_ua: Відкрийте свій вебсайт у вебпереглядачі.
zh_tw: 在瀏覽器中開啟你的網站。

source: Templates
nl: Sjablonen
ru_ru: Шаблоны
sk_sk: Šablóny
uk_ua: Шаблони
zh_tw: 範本

source: Load HTML templates used by your website.
nl: Laad HTML-sjablonen die door uw website worden gebruikt.
ru_ru: Загрузите HTML-шаблоны, используемые вашим сайтом.
sk_sk: Načíta HTML šablóny použité vo vašej webovej stránke.
uk_ua: Завантажте шаблони HTML, що використовуються вашим вебсайтом.
zh_tw: 載入你的網站使用的 HTML 範本。

source: Load CSS files used by your website.
nl: Laad CSS-bestanden die door uw website worden gebruikt.
ru_ru: Загрузите файлы CSS, используемые вашим сайтом.
sk_sk: Načíta CSS súbory použité vo vašej webovej stránke.
uk_ua: Завантажте файли CSS, що використовуються вашим вебсайтом.
zh_tw: 載入你的網站使用的 CSS 檔案。

source: Open the directory containing images used by your website.
nl: Open de map met afbeeldingen die door uw website worden gebruikt.
ru_ru: Откройте каталог, содержащий изображения, используемые вашим сайтом.
sk_sk: Otvorí priečinok obsahujúci obrázky použité vo vašej webovej stránke.
uk_ua: Відкрийте каталог із зображеннями, які використовуються на вашому вебсайті.
zh_tw: 開啟你的網站使用的圖片檔案目錄。

source: Stop the web server.
nl: Stop de webserver.
ru_ru: Остановить веб-сервер.
sk_sk: Zastaví webový server.
uk_ua: Зупинити сервер
zh_tw: 停止網頁伺服器。

source: This is not a Python file!
nl: Dit is geen Python-bestand!
ru_ru: Это не файл Python!
sk_sk: Toto nie je Python súbor!
uk_ua: Це не файл Python!
zh_tw: 這不是 Python 檔案！

source: Mu is only able to serve a Python file. Please make sure the current tab in Mu is the one for your web application and then try again.
nl: Mu kan alleen een Python-bestand serveren. Zorg ervoor dat het huidige tabblad in Mu het tabblad is voor uw webtoepassing en probeer het opnieuw.
ru_ru: Mu может запускать только файлы Python. Убедитесь, что текущая вкладка в Mu - это вкладка вашего веб-приложения, а затем повторите попытку.
uk_ua: М'ю може обслуговувати лише файл Python. Переконайтеся, що поточна вкладка в М'ю відповідає вебзастосунку, а потім спробуйте ще раз.
zh_tw: Mu 只能識別 Python 檔案。請確認 Mu 編輯器目前分頁開啟的檔案屬於你的網頁應用，然後重試。

source: Cannot find template directory!
nl: Kan sjabloonmap niet vinden!
ru_ru: Не удается найти каталог шаблонов!
sk_sk: Nepodarilo sa nájsť priečinok so šablónami!
uk_ua: Не вдається знайти каталог шаблонів!
zh_tw: 無法找到範本目錄！

source: To serve your web application, there needs to be a 'templates' directory in the same place as your web application's Python code. Please fix this and try again. (Hint: Mu was expecting the `templates` directory to be here: )
nl: Om uw webtoepassing te bedienen, moet er een map 'templates' aanwezig zijn op dezelfde plaats als de Python-code van uw webtoepassing. Verhelp dit en probeer het opnieuw. (Hint: Mu verwachtte dat de directory `templates` hier zou zijn: )
ru_ru: Для обслуживания вашего веб-приложения необходим каталог шаблонов в том же месте, что и код Python вашего веб-приложения. Исправьте это и попробуйте еще раз. (Подсказка: Mu ожидал, что здесь будет каталог `templates` :)
uk_ua: Щоб обслуговувати вашу вебзастосунок, потрібен каталог 'шаблонів' у тому ж місці, що й код Python вашого вебзастосунку. Виправте помилку та повторіть спробу. (Підказка: М'ю очікує, що каталог 'шаблонів' буде тут: )
zh_tw: 要在本機執行你的網頁應用，必須在網頁應用的 Python 程式碼所在的同一目錄下有一個「templates」目錄。請修正此問題並重試。 (提示：Mu 期望 `templates` 目錄在這裡： )

source: Too many web apps.
zh_tw: 網頁應用過多。

source: Please ensure you only have one open Python file for a web application.
zh_tw: 請確保你只有一個開啟的 Python 檔案用於網頁應用。

source: Cannot Open Website - Server not Running.
nl: Kan website niet openen - Server draait niet.
ru_ru: Не удается открыть веб-сайт - сервер не работает.
sk_sk: Webová stránka sa nedá otvoriť - server nie je spustený.
uk_ua: Неможливо відкрити вебсайт - сервер не працює.
zh_tw: 無法開啟網站 - 伺服器未執行。

source: You must have the local web server running in order to view your website in a browser. Click on the 'Run' button to start the server and then try again.
nl: U moet de lokale webserver hebben draaien om uw website in een browser te kunnen bekijken. Klik op de knop 'Uitvoeren' om de server te starten en probeer het opnieuw.
ru_ru: У вас должен быть запущен локальный веб-сервер, чтобы просматривать ваш веб-сайт в браузере. Нажмите кнопку «Выполнить», чтобы запустить сервер, а затем повторите попытку.
sk_sk: Ak chcete zobraziť vašu webovú stránku v prehliadači, musíte mať spustený lokálny webový server. Spustite ho kliknutím na tlačidlo 'Spustiť' a potom to skúste to znova.
uk_ua: Щоб переглянути свій вебсайт у вебпереглядачі, необхідно запустити локальний вебсервер. Натисніть кнопку "Запустити", щоб запустити сервер, а потім спробуйте ще раз.
zh_tw: 要在瀏覽器中存取你的網站，必須在本機執行 Web 伺服器。點選「執行」按鈕以啟動伺服器，然後重試。

source: Mu is only able to deploy a Python file. Please make sure the current tab in Mu is the one for your web application and then try again.
zh_tw: Mu 只能識別 Python 檔案。請確認 Mu 編輯器目前分頁開啟的檔案屬於你的網頁應用，然後重試。

source: To deploy your web application, there needs to be a 'templates' directory in the same place as your web application's Python code. Please fix this and try again. (Hint: Mu was expecting the `templates` directory to be here: )
zh_tw: 要部署你的網頁應用，必須在網頁應用的 Python 程式碼所在的同一目錄下有一個「templates」目錄。請修正此問題並重試。 (提示：Mu 期望 `templates` 目錄在這裡： )

source: Python3 (Jupyter)
nl: Python3-gegevenstupel

source: {} REPL
nl: Python3-gegevenstupel

source: Mu {}
uk_ua: М'ю {}

source: Mu
uk_ua: М'ю

source: Lego MicroPython
ru_ru: Лего MicroPython
