Repository: blackteahamburger/mu
Catalog: mu/locale/*/LC_MESSAGES/mu.po
Languages: nl, ru_ru, sk_sk, uk_ua, zh_tw

source: This editor is called Mu (you say it 'mew' or 'moo').
nl: Deze editor heet Mu (je zegt het 'mew' of 'moo').
ru_ru: Этот редактор называется Mu (произносится как «мяу» или «му»).
sk_sk: Tento editor sa volá Mu (vyslovuje sa ako 'mjú' alebo 'mú').
uk_ua: Цей редактор називається Mu (вимовляється як "м'ю" або "мю").
zh_tw: 這個編輯器名為 Mu，你可以讀作「謬 (miu)」或「沐 (mu)」。

source: Google, Facebook, NASA, Pixar, Disney and many more use Python.
nl: Google, Facebook, NASA, Pixar, Disney en nog veel meer organisaties gebruiken Python.
ru_ru: Google, Facebook, NASA, Pixar, Disney и многие другие компании используют Python.
sk_sk: Google, Facebook, NASA, Pixar, Disney a mnohí ďalší používajú Python.
uk_ua: Google, Facebook, NASA, Pixar, Disney та багато інших використовують Python.
zh_tw: Google、Facebook、NASA、皮克斯、迪士尼等等都在使用 Python。

source: Programming is a form of magic. Learn to cast the right spells with code and you'll be a wizard.
nl: Programmeren is een vorm van magie. Leer de juiste code-spreuken te gebruiken en je wordt een tovenaar.
ru_ru: Программирование - это магия. Научитесь произносить правильные заклинания с помощью кода, и вы станете волшебником.
sk_sk: Programovanie je forma mágie. Naučte sa používať správne kúzla pomocou kódu a stanete sa čarodejníkom.
uk_ua: Програмування - форма магії. Навчіться робити правильні 'заклинання' за допомогою коду, і ви станете чарівником.
zh_tw: 程式設計是一種魔法。透過學習使用程式碼施放正確的法術，你將成為一名魔法師。

source: REPL stands for read, evaluate, print, loop. It's a fun way to talk to your computer! :-)
nl: REPL staat voor lezen, evalueren, afdrukken, loop. Het is een leuke manier om tegen je computer te praten! :-)
ru_ru: REPL означает «цикл „чтение — вычисление — вывод“». Это интересный способ поговорить с компьютером! :-)
sk_sk: REPL je skratka pre read, evaluate, print, loop. Predstavuje zábavný spôsob, ako môžete komunikovať so svojím počítačom! :-)
uk_ua: REPL - читати(read), опрацювати(evaluate), друкувати(print), повторити(loop). Це цікавий спосіб спілкуватися з комп'ютером! :-)
zh_tw: REPL 代表「讀取 (Read)-求值 (Evaluate)-列印 (Print)」的迴圈 (Loop)。這是與你的電腦交談的一個有趣方式！:-)

source: Be brave, break things, learn and have fun!
nl: Wees dapper, breek dingen, leer en heb plezier!
ru_ru: Будьте смелыми, ошибайтесь, учитесь и получайте удовольствие!
uk_ua: Будьте сміливі, змінюйте світ, вчіться та отримуйте задоволення!
zh_tw: 要勇敢地打破一切，快樂地學習和玩耍！

source: Make your software both useful AND fun. Empower your users.
nl: Maak uw software zowel nuttig ALS leuk. Help uw gebruikers.
ru_ru: Сделайте ваше программное обеспечение полезным и увлекательным. Расширьте возможности пользователей.
sk_sk: Urobte svoj softvér užitočným aj zábavným. Posilnite svojich používateľov.
uk_ua: Зробіть своє програмне забезпечення і корисним, і цікавим. Розширюйте можливості ваших користувачів.
zh_tw: 讓你的軟體既實用又有趣。為你的使用者賦能。

source: For the Zen of Python: import this
nl: Voor de Zen van Python: importeer dit
ru_ru: По Философии Python: import this
uk_ua: По Zen для Python: import this
zh_tw: 了解 Python 之禪：import this

source: Diversity promotes creativity.
nl: Diversiteit bevordert de creativiteit.
ru_ru: Разнообразие способствует творчеству.
sk_sk: Rozmanitosť podporuje kreativitu.
uk_ua: Різноманітність сприяє творчості.
zh_tw: 多樣性促進創造力。

source: An open mind, spirit of adventure and respect for diversity are key.
nl: Een open en avontuurlijke geest en respect voor diversiteit zijn zeer belangrijk
ru_ru: Открытый ум, дух приключений и уважение к разнообразию являются ключевыми факторами.
sk_sk: Kľúčom je otvorená myseľ, dobrodružný duch a rešpekt k rozmanitosti.
uk_ua: Відкритий розум, дух пригод та повага до різноманітності є ключовими.
zh_tw: 開闊思路、冒險精神及尊重是多樣性的關鍵。

source: Don't worry if it doesn't work. Learn the lesson, fix it and try again! :-)
nl: Maak je geen zorgen als het niet werkt. Leer de les, repareer het en probeer het opnieuw! :-)
ru_ru: Не волнуйтесь, если ваше решение не работает. Извлеките из этого урок, исправьте ошибку и попробуйте еще раз! :-)
sk_sk: Netrápte sa, ak to nefunguje. Poučte sa, opravte to a skúste znova! :-)
uk_ua: Не хвилюйтесь, якщо це не працює. Перегляньте зроблене, виправте його та спробуйте ще раз! :-)
zh_tw: 如果它不起作用，別擔心。吸取教訓，修復它，然後再試一次！:-)

source: Coding is collaboration.
nl: Coderen is samenwerken.
ru_ru: Программирование - это сотрудничество.
sk_sk: Programovanie je o spolupráci.
uk_ua: Кодування - це співпраця.
zh_tw: 程式設計需要合作。

source: Compliment and amplify the good things with code.
nl: Complimenteer en versterk de goede dingen met code.
ru_ru: Делайте комплименты и улучшайте вещи с помощью программирования.
uk_ua: Компліментуйте і підсилюйте хороші речі кодом.
zh_tw: 使用程式碼來讚美和放大美好的東西。

source: In theory, theory and practice are the same. In practice, they're not. ;-)
nl: In theorie zijn theorie en praktijk hetzelfde. In de praktijk zijn ze dat niet. ;-)
ru_ru: Теоретически теория и практика совпадают. На практике это не так. ;-)
sk_sk: Teória hovorí, že teória a prax sú rovnaké. Prax však hovorí, že nie sú. ;-)
uk_ua: У теорії - теорія та практика однакові. На практиці це не так. ;-)
zh_tw: 理論上來說，理論和實務都是一樣的。在實務中，並不是。;-)

source: Debugging is twice as hard as writing the code in the first place.
nl: Debuggen is twee keer zo moeilijk als het schrijven van de code.
ru_ru: Отладка в два раза сложнее, чем написание самого кода
sk_sk: Ladenie je dvakrát náročnejšie ako písanie kódu.
uk_ua: Виправлення коду вдвічі важче, ніж його написання.
zh_tw: 在開始的時候，除錯程式碼比寫程式碼要難兩倍。

source: It's fun to program.
nl: Het is leuk om te programmeren.
ru_ru: Программировать весело.
sk_sk: Programovanie je sranda.
uk_ua: Програмувати весело та захоплююче.
zh_tw: 程式設計是個有趣的事情。

source: Programming has more to do with problem solving than writing code.
nl: Programmeren heeft meer te maken met het oplossen van problemen dan met het schrijven van code.
ru_ru: Программирование больше связано с решением проблем, чем с написанием кода.
sk_sk: Programovanie má viac do činenia s riešením problémov ako s písaním kódu.
uk_ua: Програмування більше пов'язане з вирішенням проблем, ніж з написанням коду.
zh_tw: 程式設計更多的是為了解決問題，而不是單純的寫程式碼。

source: Start with your users' needs.
nl: Begin met de behoeften van uw gebruikers.
ru_ru: Начните с потребностей ваших пользователей.
sk_sk: Začnite s potrebami vašich používateľov.
uk_ua: Почніть з потреб своїх користувачів.
zh_tw: 從你的使用者需求出發。

source: Try to see things from your users' point of view.
nl: Probeer dingen te zien vanuit het oogpunt van uw gebruikers.
ru_ru: Попробуйте взглянуть на вещи с точки зрения пользователя.
sk_sk: Snažte sa vidieť veci z pohľadu vašich používateľov.
uk_ua: Спробуйте побачити речі з точки зору користувачів.
zh_tw: 嘗試從使用者的角度看問題。

source: Put yourself in your users' shoes.
nl: Verplaats uzelf in de schoenen van uw gebruikers.
ru_ru: Поставьте себя на место пользователя.
sk_sk: Snažte sa vidieť veci z pohľadu vašich používateľov.
uk_ua: Поставте себе на місце користувачів.
zh_tw: 讓自己站在使用者的位置上。

source: Explaining a programming problem to a friend often reveals the solution. :-)
nl: Een programmeerprobleem uitleggen aan een vriend onthult vaak de oplossing. :-)
ru_ru: Объяснение проблемы программирования другу часто помогает найти решение. :-)
sk_sk: Vysvetlenie programátorského problému kamarátovi častokrát odhalí jeho riešenie. :-)
uk_ua: Пояснення другові проблеми у програмуванні часто допомагає знайти рішення. :-)
zh_tw: 與朋友討論程式設計中遇到的問題，通常會獲得新的解決方案。:-)

source: If you don't know, ask. Nobody to ask? Just look it up.
nl: Als je het niet weet, vraag het dan. Niemand om te vragen? Zoek het op.
ru_ru: Если не знаете, спросите. Не у кого спросить? Просто попробуйте поискать ответ в интернете.
sk_sk: Ak niečo nevieš, tak sa pýtaj. Niet koho? Tak si to nájdi.
uk_ua: Якщо ви чогось не знаєте - запитайте. Немає кого запитати? Просто озирніться навколо.
zh_tw: 如果你不知道，就提問吧。找不到人問的話，就自己查查看吧。

source: Complexity is the enemy. KISS - keep it simple, stupid!
nl: Complexiteit is de vijand. KISS - keep it simple, stupid!
ru_ru: Сложность - это враг. KISS (keep it simple, stupid)- Делай проще, глупыш!
sk_sk: Zložitosť je nepriateľ. KISS - keep it simple, stupid! (sprav to krátke a jednoduché)
uk_ua: Складність - ворог. Гарні речі не можуть бути складними!
zh_tw: 複雜是敵人。KISS - keep it simple, stupid!（保持簡單和純粹！）

source: Beautiful is better than ugly.
nl: Mooi is beter dan lelijk.
ru_ru: Красивое лучше уродливого.
sk_sk: Krásny je lepší ako škaredý.
uk_ua: Красиве краще, ніж потворне.
zh_tw: 美觀勝於醜陋。

source: Explicit is better than implicit.
nl: Expliciet is beter dan impliciet.
ru_ru: Явное лучше, чем неявное.
sk_sk: Explicitný je lepší ako implicitný.
uk_ua: Явне краще, ніж неявне.
zh_tw: 顯式勝於隱式。

source: Simple is better than complex. Complex is better than complicated.
nl: Simpel is beter dan complex. Complex is beter dan ingewikkeld.
ru_ru: Простое лучше, чем сложное. Сложное лучше, чем запутанное.
sk_sk: Jednoduché je lepšie ako zložité. Zložité je lepšie ako komplikované.
uk_ua: Просте - краще, ніж складне. Складне краще, ніж заплутане.
zh_tw: 簡單勝於複雜。複雜勝於難懂。

source: Flat is better than nested.
nl: Plat is beter dan genest.
ru_ru: Плоское лучше, чем вложенное.
uk_ua: Плоске краще, ніж вкладене.
zh_tw: 扁平勝於巢狀。

source: Sparse is better than dense.
nl: Spaarzaam is beter dan dicht.
ru_ru: Разреженное лучше, чем плотное.
uk_ua: Розріджене краще, ніж щільне.
zh_tw: 分散勝於密集。

source: Readability counts.
nl: Leesbaarheid telt.
ru_ru: Читаемость имеет значение.
sk_sk: Čitateľnosť sa počíta.
uk_ua: Читабельність має значення.
zh_tw: 可讀性應當被重視。

source: Special cases aren't special enough to break the rules. Although practicality beats purity.
nl: Speciale gevallen zijn niet speciaal genoeg om de regels te overtreden. Hoewel bruikbaarheid beter is dan puurheid.
ru_ru: Особые случаи не настолько особые, чтобы нарушать правила. При этом практичность важнее безупречности.
sk_sk: Špeciálne prípady nie sú natoľko špeciálne, aby porušovali pravidlá. Aj keď praktickosť poráža čistotu.
uk_ua: Особливі випадки не настільки особливі, щоб порушувати правила. При цьому практичність важливіша за бездоганність.
zh_tw: 儘管實用性會打敗純粹性，特例也不能凌駕於規則之上。

source: Errors should never pass silently. Unless explicitly silenced.
nl: Fouten mogen nooit stil voorbijgaan. Tenzij expliciet het zwijgen opgelegd.
ru_ru: Ошибки никогда не должны замалчиваться. Если они не замалчиваются явно.
sk_sk: Chyby by nikdy nemali prejsť ticho. Pokiaľ nie sú vyslovene umlčané.
uk_ua: Помилки ніколи не повинні замовчуватися. Якщо вони не замовчуються явно.
zh_tw: 除非明確地使其沉默，錯誤永遠不應該默默地溜走。

source: In the face of ambiguity, refuse the temptation to guess.
nl: Weiger de verleiding om te raden vanwege ambigu�teit.
ru_ru: Встретив двусмысленность, отбрось искушение угадать.
uk_ua: В умовах неоднозначності не покладайтеся на свої здогадки.
zh_tw: 面對不明確的定義，拒絕猜測的誘惑。

source: There should be one-- and preferably only one --obvious way to do it.
nl: Er zou ��n - en bij voorkeur slechts ��n - voor de hand liggende manier moeten zijn om het te doen.
ru_ru: Должен существовать один и, желательно, только один очевидный способ сделать это.
sk_sk: Mal by existovať jeden – a pokiaľ možno len jeden – zrejmý spôsob, ako to urobiť.
uk_ua: Повинен бути один, і бажано лише один, очевидний спосіб це зробити.
zh_tw: 只用一種方法，最好只有一種方法來做一件事。

source: Now is better than never. Although never is often better than *right* now.
nl: Nu is beter dan nooit. Hoewel nooit vaak beter is dan *juist* nu.
ru_ru: Сейчас лучше, чем никогда. Хотя никогда зачастую лучше, чем прямо сейчас.
sk_sk: Teraz je lepšie ako nikdy. Hoc nikdy je častokrát lepšie než *práve* teraz.
uk_ua: Зараз краще, ніж ніколи. Але часто ніколи краще, ніж прямо зараз.
zh_tw: 現在做總比不做好，雖然有時候不做比立刻做更好。

source: If the implementation is hard to explain, it's a bad idea.
nl: Als de implementatie moeilijk uit te leggen is, is het een slecht idee.
ru_ru: Если реализацию сложно объяснить — идея плоха.
sk_sk: Ak sa implementácia ťažko vysvetľuje, je to zlý nápad.
uk_ua: Якщо реалізацію важко пояснити, це погана ідея.
zh_tw: 如果寫的程式碼很難清楚表述的話，那就是個糟糕想法。

source: If the implementation is easy to explain, it may be a good idea.
nl: Als de implementatie gemakkelijk uit te leggen is, kan het een goed idee zijn.
ru_ru: Если реализацию легко объяснить — идея, возможно, хороша.
sk_sk: Ak sa dá implementácia jednoducho vysvetliť, môže to byť dobrý nápad.
uk_ua: Якщо реалізацію легко пояснити, це може бути гарною ідеєю.
zh_tw: 如果寫的程式碼很容易清楚表述的話，那很有可能是個好想法。

source: Namespaces are one honking great idea -- let's do more of those!
nl: Ruimte voor namen zijn een geweldig idee - laten we er meer van doen!
ru_ru: Пространства имён — отличная штука! Будем делать их больше!
sk_sk: Menné priestory sú skvelý nápad -- robme ich viac!
uk_ua: Простори імен - це чудова ідея - давайте зробимо більше таких!
zh_tw: 命名空間是個絕妙的想法，讓我們多多地使用它們吧！

source: Mu was created by Nicholas H.Tollervey.
nl: Mu is gemaakt door Nicholas H.Tollervey.
ru_ru: Mu был создан Николасом Х.Толлервеем.
sk_sk: Mu bol vytvorený Nicholasom H.Tollervey-om.
uk_ua: М'ю створив Ніколас Х.Толлервей.
zh_tw: Mu 由 Nicholas H.Tollervey 創造。

source: To understand what recursion is, you must first understand recursion.
nl: Om te begrijpen wat recursie is, moet u eerst recursie begrijpen.
ru_ru: Чтобы понять, что такое рекурсия, вы должны сначала понять рекурсию.
sk_sk: Aby ste pochopili, čo je to rekurzia, musíte najprv pochopiť rekurzii.
uk_ua: Щоб зрозуміти, що таке рекурсія, потрібно спочатку зрозуміти рекурсію.
zh_tw: 要理解遞迴是什麼，你必須先了解遞迴。

source: Algorithm: a word used by programmers when they don't want to explain what they did.
nl: Algoritme: een woord dat door programmeurs wordt gebruikt als ze niet willen uitleggen wat ze hebben gedaan.
ru_ru: Алгоритм - это слово, используемое программистами, когда они не хотят объяснять, что они сделали.
sk_sk: Algoritmus: slovo používané programátormi, keď nechcú vysvetliť, čo spravili.
uk_ua: Алгоритм: слово, яке використовують програмісти, коли вони не хочуть пояснювати, що зробили.
zh_tw: 演算法：程式設計師在不想解釋他們所做的事情時使用的一個詞。

source: Programmers count from zero.
nl: Programmeurs tellen vanaf nul.
ru_ru: Программисты считают с нуля.
sk_sk: Programátori počítajú od nuly.
uk_ua: Програмісти рахують від нуля.
zh_tw: 程式設計師們都從0開始計數。

source: Simplicity is the ultimate sophistication.
nl: Eenvoud is de ultieme verfijning.
ru_ru: Простота есть основа утонченности.
sk_sk: Jednoduchosť je najvyššia sofistikovanosť.
uk_ua: Простота - це найвища витонченість.
zh_tw: 簡單是終極的複雜。

source: A good programmer is humble.
nl: Een goede programmeur is bescheiden.
ru_ru: Хороший программист скромен.
sk_sk: Dobrý programátor je pokorný.
uk_ua: Хороший програміст - скромний.
zh_tw: 一個優秀的程式設計師很謙虛。

source: A good programmer is playful.
nl: Een goede programmeur is speels.
ru_ru: Хороший программист - игривый.
sk_sk: Dobrý programátor je hravý.
uk_ua: Хороший програміст дотепний.
zh_tw: 一個優秀的程式設計師富有玩心。

source: A good programmer learns to learn.
nl: Een goede programmeur leert om te leren.
ru_ru: Хороший программист учится учиться.
sk_sk: Dobrý programátor sa učí učiť sa.
uk_ua: Хороший програміст вчиться вчитися.
zh_tw: 一個優秀的程式設計師會學習如何學習。

source: A good programmer thinks beyond the obvious.
nl: Een goede programmeur denkt verder dan het voor de hand liggende.
ru_ru: Хороший программист не ограничивается очевидным.
uk_ua: Хороший програміст мислить за межами очевидного.
zh_tw: 一個優秀的程式設計師思考不止於表面的問題。

source: A good programmer promotes simplicity.
nl: Een goede programmeur bevordert eenvoud.
ru_ru: Хороший программист продвигает простоту.
sk_sk: Dobrý programátor podporuje jednoduchosť.
uk_ua: Хороший програміст сприяє простоті.
zh_tw: 一個優秀的程式設計師崇尚簡單。

source: A good programmer avoids complexity.
nl: Een goede programmeur vermijdt complexiteit.
ru_ru: Хороший программист избегает сложностей.
sk_sk: Dobrý programátor sa vyhýba zložitosti.
uk_ua: Хороший програміст уникає складності.
zh_tw: 一個優秀的程式設計師會避免複雜。

source: A good programmer is patient.
nl: Een goede programmeur is geduldig.
ru_ru: Хороший программист терпелив.
sk_sk: Dobrý programátor je trpezlivý.
uk_ua: Хороший програміст - терплячий.
zh_tw: 一個優秀的程式設計師很有耐心。

source: A good programmer asks questions.
nl: Een goede programmeur stelt vragen.
ru_ru: Хороший программист задает вопросы.
sk_sk: Dobrý programátor sa pýta.
uk_ua: Хороший програміст ставить запитання.
zh_tw: 一個優秀的程式設計師善於提問。

source: A good programmer is willing to say, 'I don't know'.
nl: Een goede programmeur is bereid om te zeggen: 'Ik weet het niet'.
ru_ru: Хороший программист готов сказать: «Я не знаю».
sk_sk: Dobrý programátor je ochotný povedať 'Ja neviem'.
uk_ua: Хороший програміст готовий сказати: 'Я не знаю'.
zh_tw: 一個優秀的程式設計師願意說：「我不懂」。

source: Wisest are they that know they know nothing.
nl: Wijs zijn zij die weten dat ze niets weten.
ru_ru: Мудры те, кто знает, что ничего не знает.
sk_sk: Najmúdrejší sú tí, ktorí vedia, že nič nevedia.
uk_ua: Наймудріші ті, хто знає, що нічого не знає.
zh_tw: 最聰明的人是那些知道自己一無所知的人。

source: Computers aren’t the thing. They’re the thing that gets us to the thing.
zh_tw: 電腦本身並不是關鍵。它們是幫助我們到達目標的工具。

source: Don't stare at a blank screen - try something out.
zh_tw: 不要盯著空白螢幕 - 嘗試一些操作。

source: If you're stuck - try explaining it to a rubber duck.
zh_tw: 如果你卡住了 - 嘗試向橡皮鴨解釋一下。

source: It's ok to be stuck, go for a walk and then try again (:
zh_tw: 卡住了沒關係，去散步，然後再試一次 (:

source: It's not a mistake to make an error.
zh_tw: 犯錯並不可恥。

source: Errors are there to learn from them. Then avoid them.
zh_tw: 錯誤是用來學習的。然後避免它們。

source: Don't look backwards for very long. We keep moving forward.
zh_tw: 不要長時間向後看。我們要繼續向前走。

source: Keep moving forward.
zh_tw: 繼續向前走。

source: Do not pass silently.
zh_tw: 不要默默地溜走。

source: Computers are not humans. There is no need arguing with them.
zh_tw: 電腦不是人類。與它們爭論沒有必要。

source: Embrace change and seek growth.
zh_tw: 擁抱變化，追求成長。

source: Live, laugh, learn!
zh_tw: 生活、歡笑、學習！

source: Let's get coding!
zh_tw: 讓我們開始程式設計吧！

source: Don't be afraid of coding, we all learn by making mistakes!
zh_tw: 不要害怕程式設計，我們都是透過犯錯來學習的！

source: above this line
nl: boven deze lijn
ru_ru: над этой линией
sk_sk: nad týmto riadkom
uk_ua: вище цього рядка
zh_tw: 在這行之上

source: Syntax error. Python cannot understand this line. Check for missing characters!
nl: Syntax error. Python begrijpt deze regel niet. Controleer op ontbrekende tekens!
ru_ru: Синтаксическая ошибка. Python не может понять эту строку. Проверьте не пропущены ли символы!
sk_sk: Syntaktická chyba. Python nemôže pochopiť tento riadok. Skontrolujte chýbajúce znaky!
uk_ua: Синтаксична помилка. Python не може зрозуміти цей рядок. Перевірте наявність відсутніх символів!
zh_tw: 語法錯誤。Python 無法理解這一行。檢查缺少的字元！

source: {} compatible
nl: {} compatibel
sk_sk: {} kompatibilné
zh_tw: {} 相容

source: The file contains characters Mu expects to be encoded as {0} or as the computer's default encoding {1}, but which are encoded in some other way. If this file was saved in another application, re-save the file via the 'Save as' option and set the encoding to {0}
nl: Het bestand bevat tekens die Mu verwacht te worden gecodeerd als {0} of als de standaardcodering van de computer {1}, maar die op een andere manier zijn gecodeerd. Als dit bestand in een andere toepassing is opgeslagen, slaat u het bestand opnieuw op via de optie 'Opslaan als' en stelt u de codering in op {0}
ru_ru: Файл содержит символы, которые не удалось распознать как {0} или как системную кодировку по умолчанию {1}. Если этот файл был сохранен в другом приложении, повторно сохраните файл с помощью меню "Сохранить как" и установите кодировку {0}
sk_sk: Súbor obsahuje znaky, o ktorých Mu očakáva, že budú zakódované ako {0} alebo ako predvolené kódovanie počítača {1}. Sú však zakódované iným spôsobom. Ak bol tento súbor uložený v inej aplikácii, uložte ho znova pomocou možnosti 'Uložiť ako' a nastavte kódovanie na {0}
uk_ua: Файл містить символи М'ю, які, як очікується, будуть закодовані як {0} або як типове кодування комп 'ютера {1}, але які закодовані якимось іншим чином. Якщо цей файл було збережено в іншій програмі, повторно збережіть файл за допомогою параметра «Зберегти як» і встановіть кодування на {0}
zh_tw: 檔案的編碼有問題，該檔案所包含字元應為 Mu 的預設編碼 {0} 或電腦的預設編碼 {1}。 如果此檔案是透過另外一個應用程式儲存，請透過「另存新檔」選項重新儲存檔案，並將編碼設定為 {0}

source: The file "{}" is already open.
nl: Het bestand "{}" is al geopend.
ru_ru: Файл "{}" уже открыт.
sk_sk: Súbor "{}" je už otvorený.
uk_ua: Файл "{}" вже відкрито.
zh_tw: 檔案「{}」已經開啟。

source: Mu cannot read the characters in {}
nl: Mu kan de tekens in {} niet lezen
ru_ru: Mu не может прочитать символы в {}
sk_sk: Mu nemôže čítať znaky v {}
uk_ua: М'ю не може прочитати символи у {}
zh_tw: Mu 無法讀取 {} 中的字元

source: Mu was not able to open this file
nl: Mu kon dit bestand niet openen
ru_ru: Mu не смог открыть этот файл
sk_sk: Mu sa nepodarilo otvoriť tento súbor
uk_ua: М'ю не може відкрити цей файл
zh_tw: Mu 無法開啟此檔案

source: Currently Mu only works with Python source files or hex files created with embedded MicroPython code.
nl: Momenteel werkt Mu alleen met Python-bronbestanden of hex-bestanden die zijn gemaakt met embedded MicroPython-code.
ru_ru: В настоящее время Mu работает только с исходными файлами Python или шестнадцатеричными файлами, созданными с помощью встроенного кода MicroPython.
sk_sk: Aktuálne dokáže Mu pracovať so zdrojovými súbormi jazyka Python alebo s hex súbormi vytvorenými pomocou kódu v jazyku MicroPython.
uk_ua: В даний час М'ю працює лише з вихідними файлами Python або шістнадцятковими файлами, створеними з вбудованим кодом MicroPython.
zh_tw: 目前，Mu 僅適用於使用嵌入式 MicroPython 程式碼建立的 Python 原始檔或 hex 檔案。

source: Could not load {}
nl: Kon niet laden {}
ru_ru: Невозможно загрузить {}
sk_sk: Nepodarilo sa načítať {}
uk_ua: Не вдалося завантажити {}
zh_tw: 無法載入 {}

source: Does this file exist? If it does, do you have permission to read it? Please check and try again.
nl: Bestaat dit bestand? Zo ja, heb je toestemming om het te lezen? Controleer en probeer het opnieuw.
ru_ru: Этот файл существует? Если да, есть ли у вас права на чтение? Пожалуйста проверьте и попробуйте снова.
sk_sk: Existuje tento súbor? Ak áno, máte povolenie na jeho čítanie? Skontrolujte ho prosím a skúste to znova.
uk_ua: Чи існує цей файл? Якщо це так, чи маєте ви дозвіл на його читання? Перевірте і повторіть спробу.
zh_tw: 這個檔案存在嗎？ 如果存在，你有讀取權限嗎？ 請檢查並重試。

source: Is this a {} file?
nl: Is dit een {} bestand?
ru_ru: Это файл формата {}?
sk_sk: Je {} súbor?
uk_ua: Це {} файл?
zh_tw: 這是一個 {} 檔案嗎？

source: It looks like this could be a {} file. Would you like to change Mu to the {}mode?
nl: Het lijkt erop dat dit een {} bestand kan zijn. Wilt u Mu wijzigen naar de {}modus?
ru_ru: Похоже, это может быть файл {}. Хотите переключить Mu в режим {}?
sk_sk: Zdá sa, že sa jedná o súbor typu {}. Chcete prepnúť Mu do režimu {}?
uk_ua: Схоже, це може бути файл {}. Чи хотіли б ви змінити М'ю на режим {}?
zh_tw: 看起來這可能是一個 {} 檔案。 你想將 Mu 改為 {} 模式嗎？

source: Could not save file (disk problem)
nl: Kon het bestand niet opslaan (schijfprobleem)
ru_ru: Не удалось сохранить файл (проблема с диском)
sk_sk: Nepodarilo sa uložiť súbor (problém s diskom)
uk_ua: Не вдалось зберегти файл (проблема с диском)
zh_tw: 無法儲存檔案（磁碟問題）
